{
	"./armorial_files/100px-Blason_Famille_fr_d'Abancourt.svg.png": "D'argent, à une aigle éployée de gueules, becquée et membrée d'or.",
	"./armorial_files/100px-Blason_Famille_fr_Abbans.svg.png": "Aban, Abban",
	"./armorial_files/100px-Armoiries_famille_d'Abbeville.svg.png": "d'or aux trois écussons de gueules",
	"./armorial_files/100px-Blason_Famille_fr_d'Abeille.svg.png": "D'azur, à une ruche d'or, accompagnée de trois abeilles de même, deux en chef et une en pointe.",
	"./armorial_files/Blason_famille_fr_ABEL.svg.png": "D'or à la bande d'azur chargée de deux molettes d'or, une en chef une en pointe; au chef d'azur chargé d'une molette d'or.",
	"./armorial_files/100px-Blason_Famille_fr_d'Abillon.svg.png": "De gueules, à cinq billettes d'argent couchées, rangées en pal.",
	"./armorial_files/100px-Blason_famille_Ablay_(ancien).svg.png": "de sable à trois têtes et cols de destriers d'argent",
	"./armorial_files/100px-Blason_Famille_fr_d'Abon.svg.png": "Parti, émanché d'or et d'azur de quatre pièces, les extrémités pommetées.",
	"./armorial_files/100px-Blason_Famille_fr_d'Abonde.svg.png": "Parti : au 1, d'azur, à trois étoiles d'or ; au 2, échiqueté d'or et d'azur, au chef d'argent, chargé d'une aigle éployée de sable.",
	"./armorial_files/100px-Blason_famille_fr_Abot.svg.png": "Ecartelé : aux 1 et 4, d'azur, à une coquille d'argent ; aux 2 et 3, d'argent, à une branche de fougère de sinople posée en pal[1].",
	"./armorial_files/100px-Blason_Famille_fr_Absolu.svg.png": "De gueules, à une croix de Malte d'or, accompagnée de deux molettes d'argent en chef, et d'un croissant du même en pointe.",
	"./armorial_files/100px-Blason_famille_fr_d-Abzac.svg.png": "d'argent à une bande d'azur chargée d'un besan d'or, à une bordure aussi d'azur chargée de dix besans d'or, ordonnés 5 en chef 2 en flanc et 3 en pointe.",
	"./armorial_files/100px-Blason_Famille_fr_Achard.svg.png": "Coupé : au 1 d'argent, à trois double triangles évidés de sable, entrelacés deux à deux, ordonnés deux et un ; au 2 d'argent aussi, à trois fasces de gueules.",
	"./armorial_files/Blason_à_dessiner.svg.png": "De gueules à trois heaumes d'argent grillés et embellis d'or.",
	"./armorial_files/100px-Blason_famille_fr_d'Aché.svg.png": "Chevronné d'or et de gueules.",
	"./armorial_files/100px-Blason_famille_fr_d'Achey.svg.png": "De gueules à deux haches d'armes d'or adossées en pal.",
	"./armorial_files/Blason_famille_fr_ACHY.svg.png": "De gueules à trois chevrons d'argent.",
	"./armorial_files/107px-Blason_famille_fr_ACHYER.svg.png": "De gueules au chevron d'hermine.",
	"./armorial_files/100px-Blason_famille_fr_des_Acres.svg.png": "D'argent à trois aiglettes éployées de sable.",
	"./armorial_files/100px-Blason_famille_fr_Adam_de_Morche-Bosc-Fontaine.svg.png": "D'argent au chevron de gueules, accompagné de trois roses du même.",
	"./armorial_files/100px-Blason_famille_fr_Adam_d'Orville.svg.png": "De gueules au chevron d'or, accompagné de trois roses d'argent.",
	"./armorial_files/100px-Blason_famille_fr_d'Adaoust.svg.png": "D'azur au chevron d'or, accompagné en pointe d'un lion du même, armé et lampassé de gueules ; au chef du second, chargé de trois étoiles de gueules.",
	"./armorial_files/100px-Blason_fr_famille_Adhémar_de_Monteil_(Vivarais).svg.png": "D'or, à trois bandes d'azur.",
	"./armorial_files/Blason_famille_fr_AGERON.svg.png": "D'argent à trois croissants de gueules, deux en chef adossés, un en pointe renversé; au chef d'azur chargé de deux étoiles d'or.",
	"./armorial_files/Agoult.svg.png": "D'or au loup ravissant d'azur, armé et lampassé de gueules.",
	"./armorial_files/Blason_à_dessiner.svg(1).png": "De gueules au griffon d'or couronné de même, la queue passé entre les jambes, retroussée sur le dos.",
	"./armorial_files/Blason_à_dessiner.svg(2).png": "D'or à l'aigle éployé de sable, à la barre de même brochant le tout.",
	"./armorial_files/Blason_Famille_Alacoque.svg.png": "D'or à un coq de gueules en chef, et un lion du même en pointe.",
	"./armorial_files/Blason_à_dessiner.svg(3).png": "Coupé d'argent et de gueules, à deux roses de l'une en l'autre.",
	"./armorial_files/Blason_famille_fr_ALBANEL.svg.png": "D'azur au chevron d'argent accompagné en chef de deux étoiles d'or et en pointe d'un croissant de même.",
	"./armorial_files/Blason_à_dessiner.svg(4).png": "Coupé eu premier de gueules au lion d'argent, lampassé de gueules; au second palé d'argent et de gueules.",
	"./armorial_files/100px-CoA_fr_Merdrignac.svg.png": "d'or, au lion couronné de gueules",
	"./armorial_files/Blason_famille_fr_ALBERT-TEMIER.svg.png": "D'azur au lion d'argent.",
	"./armorial_files/Famille_d'Albignac.svg.png": "D'azur à trois pomme de pin d'or; au chef de même; écartelé de gueules au lion d'or",
	"./armorial_files/Dauphin_de_Viennois.svg.png": "D'or au dauphin vif d'azur, crété, oreillé et barbelé de gueules.",
	"./armorial_files/100px-Armoiries_Albret.png": "De gueules plein.",
	"./armorial_files/Blason_famille_fr_ALBY.svg.png": "D'azur à deux épées d'argent passées en sautoir, la pointe en haut; au chef cousu de gueules chargées de trois étoiles d'or.",
	"./armorial_files/Blason_à_dessiner.svg(5).png": "D'or, à un loup assis de sable, la tête contournée, lampassé de gueules, au chef du mesme chargée de 3 quintefeuilles d'argent.",
	"./armorial_files/100px-Blason_Alies_Raymond.svg.png": "écartelé, au 1 et 4 d'azur à un chien d'argent, au 2 et 3 fascé d'argent et de gueules de huit pièces à la bande d'azur chargée de trois étoiles d'or",
	"./armorial_files/100px-Blason_fam_fr_Aligre_(d').svg.png": "Burelé d'or et d'azur (de dix pièces), au chef du second, chargé de trois soleils du premier.",
	"./armorial_files/Blason_famille_fr_ALLARD.svg.png": "D'or au chevron de sable accompagné de trois étoiles d'azur rangées en chef et d'un croissant de gueules en pointe.",
	"./armorial_files/Blason_à_dessiner.svg(5).png": "De sable au lion d'or armé, lampassé et couronnés de gueules, à la fasce partie d'argent et d'azur, chargée de deux étoiles de l'un en l'autre brochant sur le tout.",
	"./armorial_files/Blason_à_dessiner.svg(5).png": "De gueules à la croix d'or, cantonnée de quatre colombes d'argent.",
	"./armorial_files/100px-Blason_fam_fr_d'Allemagne.svg.png": "écartelé, aux 1 et 4 d'azur à deux lions affrontés d'or soutenant une étoile du même ; aux 2 et 3 coupé mi parti en chef a) d'azur à la tour d'or ouverte ajourée et maçonnée de sable, surmontée de trois étoiles d'argent rangées en fasce, b) de gueules à l'épée haute d'argent ; c) d'or au pont à quatre arches de sable terrassé de sinople, qui est des barons de l'Empire.",
	"./armorial_files/Blason_Alleman_de_Valbonnais.png": "De gueules semé de lys d'or, bandé d'argent",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "Écartelé au 1 et 4 d'azur à trois bande d'or, qui est d'Adhémar; au 2 et 3 parti d'azur et d'or, aux chef de gueules chargés de deux besant d'argent.",
	"./armorial_files/100px-Blason_d'Allonville_médiéval.svg.png": "d'argent à deux fasces de sable",
	"./armorial_files/100px-Blason_Amanzé.svg.png": "de gueules à trois coquilles d'or",
	"./armorial_files/100px-Blason_fam_fr_Amboise.svg.png": "palé d'or et de gueules de six pièces",
	"./armorial_files/100px-Blason_famille_fr_Amelot.svg.png": "D'azur, à trois cœurs d'or, accompagnés en chef d'un soleil du même.",
	"./armorial_files/100px-Blason_famille_fr_Andigné.svg.png": "D'argent à trois aiglettes de gueules, becquées et membrées d'azur.",
	"./armorial_files/100px-Blason_d'Andre.svg.png": "D'or, au sautoir de gueules",
	"./armorial_files/100px-Blason_Andre.svg.png": "De gueules au sautoir d'or",
	"./armorial_files/100px-Blason_de_la_famille_d'Anglemont_de_Tassigny.svg.png": "D'azur au chevron d'argent, accompagné de trois roses du même.",
	"./armorial_files/100px-Blason_Anglure.svg.png": "D'or, semé de grelots cousus d'argent soutenus chacun d'un croissant de gueules",
	"./armorial_files/100px-Blason_ville_fr_Puy-d'Arnac_(Corrèze).svg.png": "D'azur, à la bande d'or, chargée de trois mouchetures d'hermine de sable, accompagnée de deux croisettes du second, surmontée de trois ondes d'argent.",
	"./armorial_files/100px-Blason_fam_fr_Arbaleste.svg.png": "D'or au sautoir engreslé de sable, cantonné de 4 arbalètes tendues de gueules[20].",
	"./armorial_files/100px-Blason_famille_fr_d'Arexy.svg.png": "d'or à une bande de gueules chargée de 3 demi vols d'argent et accompagnée de 2 molettes de gueules, au chef d'azur chargé d'un soleil d'or",
	"./armorial_files/Blason_Famille_Arloing.svg.png": "Écartelé en sautoir au 1 d’or à une étoile d’azur ; au 2 d’azur à un lion la tête contournée d’or, armé et lampassé de gueules, brandissant de sa dextre une épée d’argent garnie d’or; au 3 d’azur à un lion contourné la tête contre-contournée d’or, armé et lampassé de gueules, brandissant de sa sénestre une épée d’argent garnie d’or; au 4 d’or à une aigle d’azur lampassée et armée de gueules.",
	"./armorial_files/100px-Blason_famille_fr_d'Arlot_de_Cumont_et_de_Saint-Saud.svg.png": "D'azur à trois étoiles d'argent rangées en fasce, accomagnées en chef d'un croissant de même et en pointe d'un arlot (ou grappe de raisin), aussi d'argent pampré et feuillé de sinople",
	"./armorial_files/100px-Blason_ville_fr_Pomponne_(Seine-et-Marne).svg.png": "D'azur, au chevron d'or, accompagné en chef de deux palmes adossées, et en pointe d'un rocher de six coupeaux, le tout de même. .",
	"./armorial_files/100px-Blason_famille_fr_Arnous-Rivière.svg.png": "Coupé : au premier de gueules aux trois étoiles d'argent rangées en fasce, au second d'argent à la rivière de sinople en fasce.",
	"./armorial_files/100px-Blason_Famille_de-Castanet-d'Armagnac.svg.png": "Aux 1 et 4 de gueules, au lévrier d'argent, accosté de gueules, bouclé, cloué d'or accompagné de deux grues aussi d'argent, le tout entouré d'une bordure crénelée de huit pièces d'or; aux 2 et 3 d'argent, chargé d'un coticé de pourpre, à la bordure aussi crénelée de six pièces de gueules.",
	"./armorial_files/100px-Blason_Arpajon_ancien.svg.png": "De gueules, à la harpe d'or, cordée de même.",
	"./armorial_files/100px-Blason_famille_fr_d'Artensec.svg.png": "d'azur à une fasce voutée d'or bordée de gueules ; au chef cousu du même, chargé d'un croissant d'argent accosté de deux étoiles aussi d'or",
	"./armorial_files/100px-Armoiries_Astarac.png": "Écartelé d'or et de gueules.",
	"./armorial_files/100px-French_heraldic_crowns_-_marquis_v2.svg.png": "D'or, à l'aigle de sable.",
	"./armorial_files/100px-Blason_famille_fr_Aubriot.svg.png": "De gueules à l'étoile d'or à huit branches, au chef bandé d’or et d’azur de six pièces et à la bordure de gueules.",
	"./armorial_files/Blason_famille_fr_d'Audiffret.svg.png": "D'or, au chevron d'azur, chargé de cinq étoiles d'or, et accompagné en pointe d'une montagne de trois coupeaux de sable, celui du milieu surmonté d'un faucon du même, la tête contournée et sa patte dextre levée ; à la bordure componée d'or et de sable de 28 pièces.",
	"./armorial_files/100px-Armes_de_la_famille_Augier_de_Moussac.png": "D'or à trois croix de sable, pommetées par le haut et posées en pal",
	"./armorial_files/100px-Blason_Maison_d'Aumont.svg.png": "D'argent, au chevron de gueules, accompagné de 7 merlettes du même (2, 2, 1 et 2).",
	"./armorial_files/100px-D'Auzac-Originel.svg.png": "Coupé au 1 de gueules à une trangle d'argent accompagnée en chef de deux étoiles d'or et en pointe d'un (alias : deux) croissant d'argent ; au 2 d'azur à une tour d'argent entourée d'un cep de vigne de sinople",
	"./armorial_files/100px-Blason_de_la_famille_Avril_de_Burey.svg.png": "D'argent au pin de sinople, au chef d'azur, chargé de trois roses (ou étoiles) d'or.",
	"./armorial_files/100px-Blason_famille_fr_Gilbert_Désiré_Joseph_Bachelu_(Baron).svg.png": "Écartelé au 1, contre-écartelé denché d'argent et de gueules, au 2 du quartier des Barons militaires ; au 3, parti : a. d'argent au chevron de gueules, accompagné de trois mains appaumées du même ; b. de gueules à trois feuilles de chêne d'argent ; au 4, coupé : a. écartelé d'argent et de gueules ; b. fascé d'or et d'azur, de quatre pièces.",
	"./armorial_files/100px-Blason_famille_Baduel_d'Oustrac.svg.png": "D'or à quatre pals d'azur",
	"./armorial_files/100px-Blason_famille_fr_De_Baecque.svg.png": "écartelé au I et IV d'or au sanglier courant de sable, au II et III, d'or à l'aigle bicéphale de sable",
	"./armorial_files/100px-Blason_fam_fr_Baillet.svg.png": "D'azur à la bande d'argent accompagnée de deux dragons d'or[6].",
	"./armorial_files/100px-Blason_de_la_famille_de_Bailleul_(_Pays_de_Caux).svg.png": "D'argent, à la fasce de gueules, accompagnée de 3 mouchetures d'hermine de sable, 2 en chef et une en pointe.",
	"./armorial_files/100px-Blason_de_la_famille_Debalandonne.svg.png": "D'argent au lion de sable lampassé de gueules ; au chef d'azur chargé de trois molettes d'or.",
	"./armorial_files/Ecu_de_sable_à_la_fasce_d'or.svg.png": "De sable à une fasce d'or.",
	"./armorial_files/96px-Armes_anciennes_de_la_famille_Cabalbi.jpg": "olim",
	"./armorial_files/100px-Blason_famille_Bancalis_de_Maurel_d'Aragon.svg.png": "olim",
	"./armorial_files/100px-Blason_de_la_ville_de_Banyuls_dels_Aspres_(66).svg.png": "Fascé de sable et d'argent de six pièces.",
	"./armorial_files/100px-Blason_de_la_famille_de_Barante.svg.png": "Ecartelé aux 1 et 4 d'or à une bruyère de sinople, soutenue d'une champagne de même, au chef d'azur chargé d'un soleil rayonnant d'argent; aux 2 et 3 d'azur à la croix pattée d'argent",
	"./armorial_files/100px-Blason_de_la_famille_Barazer_de_Lannurien.svg.png": "De gueules à une barre d’hermine( s), accostée de deux annelets d’argent[32]",
	"./armorial_files/Blason_famille_fr_Barbey_d'_Aurevilly.svg.png": "D'azur, à deux bars adossés d'argent, au chef de gueules, chargé de trois besants d'or.",
	"./armorial_files/Blason_De_Barbeyrac.svg.png": "De gueules à un cheval gai d'argent au chef cousu d'azur chargé d'un croissant d'argent accosté de deux étoiles d'or.",
	"./armorial_files/Blason_famille_fr_Barbizy.svg.png": "D'azur, à une brebis d'argent passant sur une terrasse de sinople, au lambel d'or.",
	"./armorial_files/100px-Blason_Famille_fr_Barbou.png": "D'azur, à la main dextre de carnation, parée d'argent, mouvante d'une nuée du même au flanc senestre, et tenant une palme et un épi de blé d'or, passés en sautoir, le tout surmonté d'un croissant renversé d'or, où le croissant est montant.",
	"./armorial_files/Blason_famille_Bareth.svg.png": "D’azur à une étoile à quatre rais d’argent au chef du même.",
	"./armorial_files/100px-Baroux.jpg": "Palé de huit pièces de gueules et d'azur. Un ours et un loup rampants se faisant face tous deux cendrés tenants deux lances de tournois d'argent passées en sautoir, accompagnés au point du chef d'une croix pattée d'argent.",
	"./armorial_files/100px-Blason_famille_fr_de-Barrau.svg.png": "D'argent à un chevron d'azur accompagné en pointe d'un lion rampant de gueules ; au chef d'azur chargé d'un croissant d'argent accosté de 2 étoiles du même",
	"./armorial_files/100px-Blason_Famille_fr_Barreau_de_Muratel.svg.png": "Barré d'argent et de pourpre",
	"./armorial_files/100px-Blason_fam_fr_Barrin.svg.png": "D'azur, à trois papillons d'or.",
	"./armorial_files/100px-Blason_de_la_famille_de_Barruel.svg.png": "Barré d'or et d'azur de 6 pièces",
	"./armorial_files/100px-Blason_Baux_de_Provence.svg.png": "de gueules, l'étoile 16-rayons d'argent (Baux)",
	"./armorial_files/100px-Blason_deBazelaire.svg.png": "d'argent, au faisceau de trois flèches de gueules, au chef d'azur chargé de trois étoiles d'argent",
	"./armorial_files/100px-Blason_famille_fr_Beaudouin-de-Saint-Georges.svg.png": "D'azur à trois chevrons d'or accompagnés de deux étoiles d'argent",
	"./armorial_files/Blason_ville_fr_Beaufremont_(Vosges).svg.png": "Vairé d'or et de gueules",
	"aucune image": "D'azur, au chef d'argent, chargé d'un lion naissant de gueules, à la cotice d'or brochant sur le tout.",
	"./armorial_files/100px-Blason_ville_fr_Beaujeu_(Rhône).svg.png": "D'or, au lion de sable armé et lampassé de gueules, au lambel de cinq pendants de gueules, brochant sur le lion.",
	"./armorial_files/Blason_famille_fr_de_Beaumont_du_Repaire_et_de_Beynac.svg.png": "De gueules à la fasce d'argent, chargée de trois fleurs de lys d'azur",
	"./armorial_files/100px-Blason_famille_fr_de_Beaupoil_de_Saint-Aulaire.svg.png": "De gueules à trois accouples de chiens d'argent posés à plomb, les laisses d'azur à dextre et en fasce.",
	"./armorial_files/100px-Blason_de_la_famille_Beaurepaire_Louvagny.svg.png": "De sable à trois gerbes d’avoine d’argent.",
	"./armorial_files/100px-Blason_famille_Becdelièvre.svg.png": "De sable, à deux croix de calvaire, treflées et fichées d'argent, accompagnées en pointe d'une coquille du même.",
	"./armorial_files/100px-Blason_famille_fr_Becquet-de-Sonnay.svg.png": "De gueules à trois chevrons d'argent.",
	"./armorial_files/100px-Armes_Beguin-Billecocq.png": "D'azur, à une oye d'argent, le col passé dans une couronne d'or, et un croissant d'argent posé en chef, accosté de deux roses de même",
	"./armorial_files/100px-Blason_Augustin_Daniel_Belliard_(1769-1832).svg.png": "Écartelé: au 1, d'azur, à l'épée haute d'argent garnie d'or ; au 2, de gueules, aux ruines d'argent ; au 3, de gueules, à un palmier terrassé d'argent adextré d'une pyramide et senestré de deux autres du même ; au 4, d'or, au cheval cabré de sable",
	"./armorial_files/100px-Blason_famille_fr_de_Belloc_de_Chamborant.svg.png": "Écartelé aux 1 et 4 : coupé d'or et de gueules à la bande coupée d'azur et d'or chargé d'un poisson d'argent, et aux 2 et 3 d'or au lion rampant de sable, armé et lampassé de gueules.",
	"./armorial_files/100px-Blason_famille_fr_Benoist-de-la-Grandière.svg.png": "D'azur à une cloche d'argent accostée de deux étoiles du même ; au chef cousu de gueules chargé de trois tours d'argent.",
	"./armorial_files/100px-Blason_famille_Benoît.svg.png": "D'azur à 3 pals d'or, au chef d'argent, chargé de 3 merlettes de sable",
	"./armorial_files/100px-Blason_du_Béarn.svg.png": "D'or aux deux vaches de gueules, accornées, colletées et clarinées d'azur, passant l'une sur l'autre (Béarn)",
	"./armorial_files/100px-Blason_ville_fr_Ales_(Gard).svg.png": "De gueules, au demi-vol d'argent[6].",
	"./armorial_files/100px-BlasonBerlier.jpg": "D'azur à un bélier passant d'argent; au chef cousu de gueules chargé de trois besants d'or",
	"./armorial_files/Blason_famille_fr_Bernard.svg.png": "D’argent à trois abeilles au naturel, 2 et 1 ; parfois les abeilles accompagnent un chevron de gueules.",
	"./armorial_files/100px-Blason_Jean-Baptiste_Berthier_(1721-1804).svg.png": "D'azur, à deux épées d'argent, garnies d'or, passées en sautoir, cantonnées en chef d'un soleil, en flanc et en pointe de trois cœurs du même, enflammés de gueules[6],[11]",
	"./armorial_files/100px-Blason_Bertran_de_Balanda.svg.png": "Parti, au I, d'azur à la bande de gueules bordée d'or (qui est Bertran), au II, de gueules à deux béliers d'argent passants l'un sur l'autre, accornés, accolés et clarinés d'or (qui est de Balanda).",
	"./armorial_files/100px-Blason_famille_Bertrand_(de).svg.png": "De gueules, à trois trèfles d'or",
	"./armorial_files/100px-Blason_Maison_de_Béthune.svg.png": "D'argent à la fasce de gueules.",
	"./armorial_files/100px-Blason_famille_fr_Besancenot.svg.png": "D'azur, à un palmier arraché de sinople",
	"./armorial_files/100px-French_heraldic_crowns_-_marquis_v2.svg.png": "D’azur à une fasce d’or chargé de deux étoiles de gueules et une coquille d’or en pointe.",
	"./armorial_files/100px-Blason_famille_Besson_de_la_Rochette.svg.png": "D'azur à la fasce d'or accompagné en pointe d'une montagne d'argent et en chef d'un croissant du même.",
	"./armorial_files/100px-Bambecque_(59)_Nord.svg.png": "D'argent au lion de sable, armé et lampassé de gueules.",
	"./armorial_files/100px-Blason_famille_fr_Bezard-Falgas.svg.png": "De gueules à deux chevrons d'or, au chef cousu d'azur chargé d'une étoile d'or.",
	"./armorial_files/100px-Blason_Famille_fr_de_Bigorie.png": "De sinople à trois pals d'argent[45].",
	"./armorial_files/100px-Blason_fam_fr_Bigot_(de_Préameneu).svg.png": "De sable, à trois têtes de léopard d'or, lampassées de gueules.",
	"./armorial_files/100px-Blason_de_la_famille_de_Bizemont.svg.png": "D'azur, au chevron d'or, accompagné en chef de deux croissants d'argent, et en pointe d'une molette d'éperon d'or",
	"./armorial_files/100px-Blason_Bizot.png": "D'argent, un chevron d'or accompagné de 3 roses, 2 en chef et 1 en pointe.",
	"./armorial_files/100px-Blacas.svg.png": "D'argent à la comète à seize rais de gueules.",
	"./armorial_files/100px-Armoiries_Famille_de_Blanquefort.svg.png": "Contrebandé de 4 pièces d'or et de gueules.",
	"./armorial_files/Parchappe.jpg": "d'azur, au chevron d'or, accompagné de trois blondeaux ou tourterelles du même, 2 et 1",
	"./armorial_files/Blason_famille_fr_de_Galembert.svg.png": "D'azur au chevron d'or accompagné de trois roses de même, au chef d'argent chargé de trois merlettes d'azur.",
	"./armorial_files/100px-Blason_Famille_fr_Bohier.png": "d’or, au lion d’azur, au chef de gueules",
	"./armorial_files/100px-Blason_Boileau_de_St_Pau.svg.png": "D'azur au chevron d'or surmonté de 3 trèfles d'or mal ordonnés",
	"./armorial_files/100px-Boiseon.svg.png": "D'azur, au chevron d'argent, accompagné de trois têtes de léopard d'or.",
	"./armorial_files/100px-Blason_fr_famille_Boissat.svg.png": "de gueules à la bande d'argent accompagnée de 6 besants d'or mis en orle",
	"./armorial_files/Blason_Boissieu.svg.png": "D'azur au chevron d'or chargé à la pointe d'un trèfle du premier",
	"./armorial_files/100px-Blason_fam_fr_Bonaparte.svg.png": "De gueules à deux barres d'or accompagnées de deux étoiles du même, une en chef, l'autre en pointe.",
	"./armorial_files/Blason_deBonnecaze.svg.png": "Écartelé, au 1 d'azur à trois tourteaux de sable, accostés de deux étoiles d'or, au 2 d'or à trois croissants d'azur, au 3 de gueules à la tour d'argent, au 4 d'or au lion de sable.",
	"./armorial_files/Blason_fam_fr_Bonnin_de_La_Bonninière_de_Beaumont.svg.png": "D'argent, à une fleur-de-lis de gueules.1 Supports : deux lions, au naturel",
	"./armorial_files/Blason_famille_fr_Borrey.svg.png": "D'argent à trois bandes d'azur, au chef de gueules chargé d'un lion léopardé d'argent",
	"./armorial_files/100px-Blason_de_Boscas.svg.png": "d'argent au lion couché d'or * au pied d'un arbre; au chef d'azur chargé de 3 roses d'or",
	"./armorial_files/100px-Blason_famille_fr_du_Bosc_de_Taret.svg.png": "Écartelé : aux 1 et 4 d'azur au lévrier courant de sable* ; aux 2 et 3 de sable au lion d'or morné.",
	"./armorial_files/100px-Blason_famille_fr_de_Boucher-de-la-Tour-du-Roch.svg.png": "D'argent à deux lions rampants (aliàs affrontés) de gueules; au chef d'azur chargé d'un croissant accosté de deux étoiles, le tout d'or.",
	"./armorial_files/100px-Blason_Famille_fr_Boudran.svg.png": "D'azur à la bande d'or chargée de trois cœurs de gueules.",
	"./armorial_files/100px-Blason_famille_Bourbon-Busset_moderne.svg.png": "De Bourbon au chef de Jérusalem",
	"./armorial_files/100px-Blason_de_la_famille_de_Bourgoing.svg.png": "D'azur à la croix ancrée d'or.",
	"./armorial_files/100px-Blason_de_la_famille_Bourgoing.svg.png": "olim",
	"aucune image": "De gueule au lys d'or surmonté d'un château de sable, bordé d'azur à la chaine d'or en pointe surmontée d'une étoile etavec cinq coquilles de même.",
	"./armorial_files/100px-Blason_Famille_fr_Bourguignon_d_Herbigny.png": "De sable à une flamme de gueules mouvante de la pointe de l'écu[50].",
	"./armorial_files/100px-Bourret.svg.png": "D'azur à trois cannettes d'argent.",
	"./armorial_files/100px-Blason_fam_fr_Bouville.svg.png": "D'argent à la fasce de gueules chargée de trois annelets d'or.",
	"./armorial_files/100px-Blason_famille_fr_de-Bovis.svg.png": "Coupé, au 1 d'azur à un chevron d'or accompagné de trois roses d'argent, au 2 de gueules à un bœuf passant d'argent.",
	"./armorial_files/100px-Armoirie_de_Boyer_Montegut.svg.png": "D'argent au chevron de sable, accompné, en chef de 2 croissants du mesme et, en pointe d'une corneille aussi de sable ; au chef d'azur, chargé dun croissant d'or accosté de 2 étoiles du mesme.",
	"./armorial_files/100px-Blason_fam_fr_Bragelongne_(de).svg.png": "De gueules, à la fasce d'argent, chargée d'une coquille de sable, et accompagnée de trois molettes d'éperon d'or.",
	"./armorial_files/100px-Armes_Brébisson.svg.png": "De gueules au lion d'argent.",
	"./armorial_files/100px-Blason_famille_fr_de-Brianson.svg.png": "De gueules à trois faces ondées d'or",
	"./armorial_files/100px-Blason_Famille_Briconnet.svg.png": "D'azur, à la bande componnée d'or et de gueules de cinq pièces, le premier compon de gueules ch d'une étoile d'or, ladite bande acc. d'une étoile d'or au canton senestre du chef.",
	"./armorial_files/100px-Armoiries_Brienne-Eu.svg.png": "Écartelé : I et IV, d'azur, semé de billettes d'or, au lion du même, armé et lampassé de gueules, brochant sur le tout ; II et III, d'azur à la bande d'argent côtoyée de deux doubles cotices potencées et contre-potencées d'or ; sur-le-tout d'argent à la croix potencée d'or, cantonnée de quatre croisettes du même.",
	"./armorial_files/Blason_famille_Brosse.svg.png": "Armes anciennes : d'azur, à trois gerbes de blé (ou brosses) d'or liées de gueules",
	"./armorial_files/100px-Blason_famille_Broglie.svg.png": "D'or, au sautoir ancré d'azur.",
	"./armorial_files/Blason_famille_Broquet.svg.png": "D'azur au cerf élancé d'or, accompagné en pointe d'une étoile à huit rais du même",
	"./armorial_files/100px-Broquet_de_Bellavesne.jpg": "D'or à trois merlettes de sable",
	"./armorial_files/100px-Blason_Famille_fr_Brossart_de_Cléry.svg.png": "D'azur au chevron d'argent, accompagné de trois fleurs de lys d'or.",
	"./armorial_files/100px-Blason_famille_fr_Boussas-de-la-Bareille.svg.png": "D'azur, au chevron d'or, accompagné en chef de deux roses du même, et en pointe d'un sphinx grec aussi d'or.",
	"./armorial_files/100px-Blason_famille_fr_de_Bruc.svg.png": "D'argent, à la rose de gueules boutonnée d'or.",
	"./armorial_files/100px-Blason_famille_fr_de_Bruchard.svg.png": "D'azur, à trois fasces d'or et à la bande de gueules brochant sur le tout",
	"./armorial_files/100px-Blason_Famille_fr_de-Brueys.svg.png": "Oculi mei semper ad dominum",
	"./armorial_files/100px-Blason_fam_fr_Bruyères-Chalabre.svg.png": "D’or au lion rampant de sable, armé et lampassé de gueules, la queue fourchue, nouée et passée en sautoir (qui est de Bruyères)",
	"./armorial_files/100px-Blason_famille_fr_Bucy_(de).svg.png": "D'argent à dix billettes de gueules ordonnées 4, 3, 2, 1.",
	"./armorial_files/100px-Blason_deBudos.svg.png": "D'azur à trois bandes d'or",
	"./armorial_files/100px-Blason_de_la_ville_de_Saint-Paterne-Racan_(37).svg.png": "D'azur au croissant d'argent accompagné de six croisettes potencées au pied fiché d'or ordonnées 3 et 3[60].",
	"./armorial_files/100px-Blason_Buisson_de_Bournazel.svg.png": "D'or, au buisson de sinople, le chef cousu d'argent chargé d'un lion de sable, lampassé de gueules, issant du buisson.",
	"./armorial_files/100px-Cot_of_arms_Butler.png": "D'azur au chef endenché d'or",
	"./armorial_files/100px-Blason_fr_famille_de_Buscaylet.svg.png": "D'azur à deux lions d'or debout affrontés, au chef cousu de gueules chargé d'un croissant d'argent accosté de deux étoiles d'or.",
	"./armorial_files/100px-Famille_Buy_de_Croze.png": "d'azur à la tierce d'or accompagnée en chef d'un pommier arraché d'or, feuillé de sinople et fruité de gueules, accosté d'un dextrochère et d'un sénestrochère adossés de carnation tenant chacun une épée d'argent garnie d'or, et en pointe d'une tête d'ange aux ailes déployées d'argent et la bouche d'or",
	"./armorial_files/100px-Blason_famille_Cabon.svg.png": "D'argent à trois têtes de coq arrachées de gueules.",
	"./armorial_files/100px-Blason_famille_fr_de_Cacqueray.svg.png": "D'or à 3 roses de gueules.",
	"./armorial_files/100px-Blason_de_Georges_Cadoudal.svg.png": "D'azur au dextrochère armé d'or, mouvant du flanc dextre, la main au naturel, tenant une épée d'argent montée d'or et chargé d'un bouclier antique d'hermines, à la fleur de lys de gueules en abîme.",
	"./armorial_files/100px-Blason_famille_fr_de-Calameau.svg.png": "D'or à trois croix de Lorraine de gueules en chef, et trois larmes de sable en pointe.",
	"./armorial_files/100px-Blason_famille_fr_de-Calouin-de-Tréville.svg.png": "De gueules à trois quintefeuilles d'argent.",
	"./armorial_files/100px-Blason_fam_fr_Cambacérès_(Ancien_Régime).svg.png": "D'or, au chevron de gueules, accompagné de trois roses du même.",
	"./armorial_files/100px-Blason_ville_fr_Le_Cambout_(Côtes-d'Armor).svg.png": "De gueules à trois fasces échiquetées d'azur et d'argent à deux tires.",
	"./armorial_files/100px-Blason_fam_fr_du_Cambout_de_Coislin.svg.png": "De gueules, à trois fasces échiquetées d'argent et d'azur de deux tires.",
	"./armorial_files/100px-Blason_de-Canal.svg.png": "D'argent au chevron d'azur.",
	"./armorial_files/100px-Blason_famille_fr_Candie.svg.png": "De gueules, semé de fleurs de lis d'or, à la bande d'azur, brochant sur le tout.",
	"./armorial_files/100px-Blason_famille_fr_Capitain-de-Clacy.svg.png": "De sinople à une bande d’or accompagnée de six besants de même en orle.",
	"./armorial_files/100px-Blason-de-Carbonnier.svg.png": "de gueules à la croix épiscopale d'argent accompagnée de deux croissants aussi d'argent, l'un en senestre supérieur, l'autre en dextre inférieur, deux étoiles du même dans les deux autres cantons",
	"./armorial_files/100px-Armoiries_Cardevac.svg.png": "D'hermine au chef de sable.",
	"./armorial_files/Blason_Famille_de_Carné.svg.png": "D'or à deux fasces de gueules.",
	"./armorial_files/100px-Blason_famille_fr_Cassini.svg.png": "D’or a la fasce d’azur accompagnée de six étoiles à six branches du même trois rangées en chef et trois rangées en champagne.",
	"./armorial_files/100px-Castelanne.svg.png": "De gueules, à la tour donjonnée de trois pièces d'or, maçonnée de sable, celle du milieu plus élevée.",
	"./armorial_files/100px-Blason_Jacques_Nompar_de_Caumont_(v_1558-1652).svg.png": "D'azur, à trois léopards d'or, l'un sur l'autre, armés, lampassés et couronnés de gueules.",
	"./armorial_files/100px-Blason_famille_fr_de_Caunes.png": "De gueules au chevron d'argent, accompagné de trois roches du même, deux en chef et une en pointe, au chef cousu d'azur, chargé de trois canettes d'argent",
	"./armorial_files/100px-Blason_de-Cavaillon.svg.png": "D'or au lion de sable, armé et lampassé de gueules.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "olim de Chabalier",
	"./armorial_files/100px-Blason_fam_fr_Chabot2.svg.png": "D'or à trois chabots de gueules en pal.",
	"./armorial_files/BlasonsGIF_chabot_de_2.png": "D'azur à une étoile d'or, chargée d'une tour de gueules.",
	"./armorial_files/Blason_de_la_famille_Chaix_de_Lavarene.svg.png": "D'or au chêne de sinople glanté d'or au chef de gueules chargé d'un croissant d'argent entre deux étoiles d'or.",
	"./armorial_files/100px-Blason_famille_fr_de-Chalon.svg.png": "d'azur au lion passant d'or",
	"./armorial_files/Blason_gueules-bande_or.svg.png": "de gueules, à la bande d'or",
	"./armorial_files/100px-Blason_fam_FRA_de_Chambes.svg.png": "D'azur, semé de fleurs-de-lis d'argent, au lion du même, armé, lampassé et couronné de gueules, brochant sur le tout",
	"aucune image": "voir La Garde de Chambonas",
	"./armorial_files/100px-Blason_de_la_ville_de_Pontailler-sur-Saône_(21).svg.png": "De gueules au lion d'or.",
	"./armorial_files/100px-Blason_famille_fr_Channac_de_la_Selve.svg.png": "D'azur, à un éperon d'or.",
	"./armorial_files/100px-Blason_famille_Chansiergues_(de).svg.png": "D'azur à 3 flambeaux d'argent, allumés de gueules, au chef cousu de gueules, chargé de 3 étoiles d'or.",
	"./armorial_files/100px-Blason_famille_de_Chapon.svg.png": "D'azur, à la bande d'or, chargées de trois têtes de lion de gueules.",
	"./armorial_files/100px-Blason_Chardiny_v2.svg.png": "D'azur au chevron d'or une écrevisse passante d'or en pointe.",
	"./armorial_files/100px-Armoiries_seigneurs_Montfort.svg.png": "De gueules, un lion d'argent langué d'or.",
	"./armorial_files/100px-Blason_famille_de_Charentenay.svg.png": "D’argent à la bande d’azur chargée de troid étoiles d’or et accompagnées de deux grappes de raisin de pourpre, feuillées et tigées de sinople, celle de la pointe ayant la queue en bas.",
	"./armorial_files/100px-Blason_famille_Charette_de_la_Contrie_GASO.svg.png": "D'argent au lion de sable, accompagné en pointe de trois canettes du même.",
	"./armorial_files/100px-Blason_famille_fr_Charny.svg.png": "De gueules aux trois écussons d'argent.",
	"./armorial_files/100px-Blason_de_la_famille_de_Charrin.svg.png": "D'argent à la fasce de sable chargée de deux annelets croisés du champ, au chef d'azur chargé de trois besants aussi d'argent.",
	"./armorial_files/100px-Blason_Jacques_François_de_Chastenet_de_Puységur.svg.png": "D'azur, au chevron d'or, accompagné en pointe d'un lion du même, au chef du second.",
	"./armorial_files/100px-Blason_Maison_de_Châteaubriant_(ancien).svg.png": "olim",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "D'azur, au chevron d'or, accompagné de trois bourdons de pèlerin du même.",
	"./armorial_files/100px-Blason_famille_fr_de_Chaunac-Lanzac.svg.png": "D'argent, au lion de sable, armé, lampassé et couronné de gueules",
	"./armorial_files/100px-Blason_famille_de_Chazelles.svg.png": "D'azur à une tête de léopard d'or, au chef de gueules chargé d'un croissant et d'une étoile d'argent.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "d'azur à un cerf rampant d'argent (qui est Chebrou)",
	"./armorial_files/Blason_de_Montbron.png": "D'azur à trois losanges d'or.",
	"./armorial_files/100px-Blason_de_Chevron-Villette.svg.png": "D'azur au chevron d'or chargé d'un chevron de gueules accompagné de trois lionceaux d'or, les deux du chef affrontés.",
	"./armorial_files/100px-Armes_famille_de_Chieusses_de_Combaud-Roquebrune.png": "Parti, au 1 d'azur, au chevron d'or, accompagné en pointe d'une rose tigée et feuillée du même, au chef d'argent ; au 2 d'or, à trois bandes de gueules, au lion d'azur, montant sur la dernière.",
	"./armorial_files/100px-Blason_ville_&_fam_fr_Choiseul_(Haute-Marne).svg.png": "D'azur, à la croix d'or, cantonnée de vingt billettes du même, cinq dans chaque canton, 2, 1 et 2.",
	"./armorial_files/100px-Blason_fam_fr_Cholet.svg.png": "D'or au pin de sinople terrassé de même et au lion léopardé de sable brochant sur le pin, au chef retrait de gueules chargé de trois étoiles d'argent.",
	"./armorial_files/100px-Blason_de_la_famille_Chosson_du_Colombier.svg.png": "De gueules au lion d'or.",
	"./armorial_files/100px-Blason_de_la_famille_chrestien.svg.png": "De sinople à la fasce d'or accompagné de trois casques du même",
	"./armorial_files/100px-Blason_Famille_fr_Ciclier.svg.png": "Parti : au 1 d'or au lion d'azur, au 2 à trois losanges en chevron inversé et au chef palé de sept pièces.",
	"./armorial_files/100px-Blason_famille_fr_Cinquin.svg.png": "D'argent au chevron de gueules, chargé de cinq coquilles d’or, accompagné en chef de deux hures de sanglier arrachée et affrontés de sable, défendus d’argent et couronnées d'or et en pointe d'un lion d'azur, couronné d’or et tenant une crosse du même.",
	"./armorial_files/100px-Famille_Circaud.png": "D'argent à une bande d'azur chargée de trois besants d'or.",
	"./armorial_files/100px-Blason_fam_fr_Clary_ancien.svg.png": "D'azur, au chevron d'or, surmonté d'un croissant d'argent, acc. en chef de deux clefs affrontées et en pointe d'un soleil, le tout du même",
	"./armorial_files/100px-Blason_fam_fr_Clary_(Clary_de_Saint-Angel).svg.png": "D'azur, au chevron d'or, surmonté d'un croissant d'argent, acc. en chef de deux clefs affrontées et en pointe d'un soleil, le tout du même",
	"./armorial_files/100px-Blason_Bioncourt_57.svg.png": "D'argent, à une fasce d'azur.",
	"./armorial_files/100px-Blason_famille_fr_de-Clerc.svg.png": "Coupé, au premier, d'or à la cuirasse de sable, surmontée de 3 étoiles, en fasce, de gueules, au deuxième, d'azur au lion d'or, armé d'un sabre, recourbé d'argent.",
	"./armorial_files/100px-Blason_Clermont-Tonnerre.svg.png": "De gueules à deux clefs d'argent passées en sautoir.",
	"./armorial_files/100px-Blason_famille_de_Coatarel.svg.png": "D'azur à trois fasces d'argent.",
	"./armorial_files/100px-Coetanlem.svg.png": "D'argent au hibou de sable becqué et membré de gueules soutenu d'une fleur de lys de sable.",
	"./armorial_files/100px-Blason_Famille_de_Coëtivi.svg.png": "Fascé d'or et de sable de six pièces.",
	"./armorial_files/100px-Blason_Famille_de_Coëtlogon.svg.png": "De gueules à trois écussons d'hermine, deux et un.",
	"./armorial_files/100px-Blason_famille_Cointet_de_Fillain.svg.png": "De sable au sautoir d'argent, au chef d'or.",
	"./armorial_files/100px-Blason_fam_fr_Colabau-Julienas_de_Châtillon.svg.png": "D'azur, à la bande d'argent, ch. de trois mouchetures d'hermine de sable.",
	"./armorial_files/100px-Blason_Colbert.svg.png": "D'or, à une couleuvre ondoyante en pal d'azur.",
	"./armorial_files/100px-Blason_de_Coligny.svg.png": "De gueules, à l'aigle d'argent, becquée, languée, membrée, armée et couronnée d'azur.",
	"./armorial_files/100px-Armoiries_Comminges_Ancien.svg.png": "D'argent, à la croix pattée de gueules.",
	"./armorial_files/100px-Compadres.svg.png": "D'argent à trois chevrons d'azur.",
	"./armorial_files/100px-Blason_fam_fr_Compaing.svg.png": "D'azur, à un massacre de cerf d'or, surmonté d'une fleur-de-lis du même.",
	"./armorial_files/100px-Blason_de_la_maison_Constant_Rebecque_(de).svg.png": "Coupé en chef d'une aigle éployée en champ d'argent & en pointe écartelé d'or & de sable",
	"./armorial_files/100px-Blason_de_la_famille_Convert_(de).svg.png": "D'argent à une larme de sable, accompagnée de trois ancolies d'azur",
	"./armorial_files/100px-Blason_de_la_famille_Corneillan_(de).svg.png": "De gueules à la bande d'argent, chargée de trois corneilles de sable",
	"./armorial_files/100px-Blason_Maison_de_Cossé-Brissac.svg.png": "De sable à trois fasces d’or, dentelées par le bas.",
	"./armorial_files/100px-Ecu_du_Couëdic_ancien.png": "D'argent à une branche de châtaignier en pal, feuillé en sa partie haute de trois pièces en bouquet d'azur.'",
	"./armorial_files/100px-Blason_famille_fr_Couëtoux_du_Tertre.svg.png": "D'argent, à deux chevrons de gueules accompagnés de trois étoiles de même, rangées deux et un.",
	"./armorial_files/100px-Blason_de_la_famille_de_Coppier.svg.png": "d'azur à trois coupes d'or",
	"./armorial_files/100px-Courbis.svg.png": "de gueules à la fasce d'or accompagnée de trois lionceaux du même",
	"./armorial_files/100px-Blason_famille_fr_de_Courbon_de_Saint-Genest.svg.png": "D'azur à la fasce d'or chargée de trois étoiles de gueules et accompagnée de quatre croissants d'or : trois en chef et un en pointe",
	"./armorial_files/100px-Armorial_des_familles_de_Champagne.svg.png": "Seigneurs de Saint-Liébault",
	"./armorial_files/100px-Blason_famille_fr_de_Courrèges.svg.png": "d'or à la fasce échiquetée d'azur et d'or de deux tires, accompagnée en chef de deux molettes d'azur et en pointe d'un lion léopardé de sable, lampassé de gueules",
	"./armorial_files/100px-Blason_famille_grassoise_Court.png": "D'or à l'arbre arraché de sinople sommé d'un pigeon d'argent becquetant le fruit de l'arbre ; au chef de gueules, chargé de trois étoiles d'or",
	"./armorial_files/100px-Ecu_losangé_d'or_et_de_gueules.svg.png": "Losangé d'or et de gueules.",
	"./armorial_files/100px-Blason_famille_fr_Cremoux.svg.png": "Sur champ d'azur, trois grenades d'or engreslées",
	"./armorial_files/100px-Blason_Charles_III_de_Créqui.svg.png": "D'or au créquier de gueules.",
	"./armorial_files/100px-French_heraldic_crowns_-_marquis_v2.svg.png": "Fuselé d'argent et de gueules.",
	"./armorial_files/100px-Armoiries_de_Mesnil_3.svg.png": "D'argent, à trois fasces de gueules.",
	"./armorial_files/100px-French_heraldic_crowns_-_marquis_v2.svg.png": "De gueules, au chevron d'argent, acc. de trois étoiles du même[41],[6].",
	"./armorial_files/100px-Blason_Crussol.svg.png": "Fascé d'or et de sinople.",
	"./armorial_files/100px-Blason_fam_fr_Cueillette.svg.png": "D'azur, au chevron d'argent, acc. de trois gerbes d'or.",
	"./armorial_files/Blason-cugnac.gif": "Gironné d'argent et de gueules.",
	"./armorial_files/100px-Armoiries_de_Custine_2.svg.png": "Écartelé aux 1 et 4 d'argent à la bande coticée de sable (de Custine) aux 2 et 3 de sable semé de fleurs-de-lis d'argent (de Lombu).",
	"./armorial_files/100px-Blason_Maison_de_Damas.svg.png": "D'or à la croix ancrée de gueules.",
	"./armorial_files/100px-Blason_famille_fr_Darodes.svg.png": "De gueules à trois lances d'argent.",
	"./armorial_files/100px-Blason_famille_fr_Dax.svg.png": "D'azur, au chevron d'or, chargé d'une quintefeuille de gueules.",
	"./armorial_files/Blason_de_la_famille_Dechanet.svg.png": "D'or au chêne englanté arraché de sinople",
	"./armorial_files/100px-Blason_famille_de-Hollain.svg.png": "D'argent au chevron de sable, chargé de trois losanges d'or, accompagné de trois tourteaux de sable, chacun chargé d'une étoile à six rais d'or",
	"./armorial_files/100px-Blason_famille_fr_Delpuech-de-Cagnac.svg.png": "De gueules au lion d'argent",
	"./armorial_files/100px-Blason_famille_fr_Desmazières_(_Flandres).svg.png": "D'argent au lion de sable, armé et lampassé de gueule, couronné d'or.",
	"./armorial_files/100px-Blason_famille_fr_Dieuleveult.svg.png": "D'azur à six croissants contournés d'argent 3,2,1.",
	"./armorial_files/100px-Digaultray.svg.png": "De sinople à une tête de léopard d'argent en chef et deux ancres du même en pointe.",
	"./armorial_files/100px-Blason_Digoine.svg.png": "Échiqueté d'argent et de sable, de six points et sept tires.",
	"./armorial_files/Blason_ville_fr_herbault_(loir-et-cher).svg.png": "D'azur à la fasce d'or chargée d'un lion issant de gueules, accompagnée de trois grenades tigées et feuillées d'or, ouvertes de gueules.",
	"./armorial_files/100px-Blason_de_la_famille_Dorion.svg.png": "D'argent fuselé de sable à la tour d'or brochant sur le tout.",
	"./armorial_files/100px-Blason_de_la_famille_du_Drac.svg.png": "D'or, au dragon de sinople couronné et lampassé de gueules.",
	"./armorial_files/100px-Blason_Comtes_de_Dreux.svg.png": "Échiqueté d'or et d'azur à la bordure de gueules.",
	"./armorial_files/100px-Blason_fr_Brézé.svg.png": "D’azur, au chevron d’or, accompagné en chef de deux roses d’argent et en pointe d’un soleil d'or.",
	"./armorial_files/100px-Blason_famille_fr_de-Drouas.svg.png": "D'azur chargé d'un chevron d'or, accompagné de trois fer de lance d'argent, deux et un ; au chef du deuxième chargé de trois mollettes de sable.",
	"./armorial_files/100px-Blason_de_la_famille_Drouet_de_La_Thibauderie.svg.png": "Ecartelé: aux 1 et 4, d'azur au chevron d'or ; aux 2 et 3, de gueules à 3 cœurs d'or, 2 et 1",
	"./armorial_files/100px-Blason_de_la_famille_Dugas-Vialis.svg.png": "D'azur au cognassier d'or, au chef de gueules chargé de deux épées d'argent passées en sautoir.",
	"./armorial_files/Blason_de_la_famille_Dugas_du_Villard.svg.png": "Coupé: au premier de gueules aux deux cimeterres d'argent passées en sautoir, au deuxième d'azur au chêne terrassé d'or.",
	"./armorial_files/100px-Blason_Famille_fr_Dupont.svg.png": "D'azur, à un pont d'argent, surmonté de trois étoiles d'or, rangées en chef.",
	"./armorial_files/Blason_famille_fr_Dupont_de_Dinechin_v2.png": "D'azur au pont d'or de trois arches, maçonné de sable et au lion d'or armé et lampassé de gueules, tenant une hache d'armes d'or, et regardant un soleil d'or naissant à dextre, une étoile d'or mise un peu en pointe à sénestre.",
	"./armorial_files/Blason_de_la_famille_Dupuy_de_Lome.svg.png": "D'or a la bande de sable chargée de trois roses d'argent au chef d'azur chargé de trois étoiles d'or aussi.",
	"./armorial_files/100px-Blason_Maison_Durfort_de_Duras.svg.png": "D'argent à la bande d'azur",
	"./armorial_files/Blason_famille_Dussargues.svg.png": "D'azur, à trois sargues d'argent marqués de raies de sable allant du dos au ventre ; au chef cousu de gueules.",
	"./armorial_files/100px-Blason_famille_fr_Dutheil_de_la_Rochere.svg.png": "D'or, au chef d'azur, au lion de gueules, armé, lampassé, et couronné d'argent, brochant sur le tout.",
	"./armorial_files/100px-Blason_famille_fr_Duval_de_Laguierce.svg.png": "De sable à trois fasces, ondées d'or",
	"./armorial_files/Blason_famille_fr_Dyo.svg.png": "Fascé d'or et d'azur, à la bordure de gueules",
	"./armorial_files/100px-Blason_Semur_Brionnais.svg.png": "D'argent, à trois bandes de gueules",
	"./armorial_files/100px-Blason_Escoubleau_de_Sourdis.svg.png": "Parti d'azur et de gueules, à la bande d'or brochant sur le tout.",
	"./armorial_files/92px-Blason_fam_fr_Esparbès_de_Lussan.svg.png": "D'argent, à la fasce de gueules, accompagnée de trois merlettes (alias trois éperviers) de sable.",
	"./armorial_files/Blason_famille_fr_Espic-Ginestet.svg.png": "D'azur à trois épis d'or surmontés d'un soleil du même",
	"./armorial_files/100px-Blason_fam_fr_Espinay_de_Saint-Luc.svg.png": "D'argent, au chevron d'azur, chargé de onze besants d'or.",
	"./armorial_files/100px-Blason_Famille_fr_d'Estaing.svg.png": "D'azur, à trois fleurs-de-lis d'or, au chef du même.",
	"./armorial_files/100px-Blason_fam_fr_Etampes_(d').svg.png": "D'azur, à deux girons d'or appointés en chevron, au chef d'argent, à trois couronnes perlées de gueules.",
	"./armorial_files/100px-Armes_de_la_famille_d'Estienne_du_Bourguet.svg.png": "D'azur à une fasce d'or accompagnée de trois besants d'argent, deux en chef et un en pointe.",
	"./armorial_files/100px-Blason_Famille_Estouteville.svg.png": "Burelé d'argent et de gueules de dix pièces, au lion de sable armé lampassé et couronné d'or, brochant sur le tout.",
	"./armorial_files/100px-Blason_Maison_d'Estrées.svg.png": "D'argent, fretté de sable, au chef d'or, chargé de trois merlettes du deuxième.",
	"./armorial_files/100px-Blason_famille_lu_Everlange.svg.png": "D'azur à la fasce d'argent accompagnée de deux étoiles d'or, l'une en chef, l'autre en pointe.",
	"./armorial_files/100px-Blason_famille_des_Épaux_(Espaux,_Expaulx).svg.png": "D'argent à 3 fasces ondées d'azur.",
	"./armorial_files/100px-Blason_de-Fabri.svg.png": "D'argent au pal d'azur : au chef de gueules chargé de trois écussons d'or.",
	"aucune image": "De gueules, à l'aigle éployée d'argent.",
	"./armorial_files/100px-Blason_famille_grassoise_Fanton_2.png": "D’azur à un chevron d’or accompagné de trois glands du même sans feuilles",
	"./armorial_files/100px-Blason_Famille_de_Farcy.svg.png": "D'or fretté d'azur, de six pièces, au chef de gueules.",
	"./armorial_files/100px-Blason_de-Faramont_ou_Framond.svg.png": "De gueules, au lion d'or, le chef cousu d'azur chargé de trois étoiles d'or.",
	"./armorial_files/100px-Blason_famille_fr_de_Faubournet_de_Montferrand.svg.png": "Écartelé d'or et de gueules.",
	"./armorial_files/100px-Blason_de_la_famille_de_Fenoyl.svg.png": "D'azur au taureau furieux d'or, au chevron de gueules brochant sur le tout.",
	"./armorial_files/100px-Blason_famille_fr_de_Feraudy.svg.png": "Fascé d'or et de gueules de six pièces à l'étoile à six rais d'azur chargeant la première et au sautoir de gueules brochant sur le tout.",
	"./armorial_files/100px-Blason_Famille_fr_Ferrand-de-la-Conté.svg.png": "De sable à la tierce ondée d'argent, mise en fasce, accompagnée de trois dards du même, 2 en chef et 1 en pointe",
	"./armorial_files/100px-Blason_famille_fr_Ferrieres-Sauveboeuf.svg.png": "D'argent au pal de gueules, accompagné de dix billettes de même, rangées en orle",
	"./armorial_files/100px-Blason_de_la_famille_Forget.svg.png": "d'azur au chevron d'or accompagné de trois coquilles du même[87]",
	"./armorial_files/100px-Armoiries_de_Ficquelmont.svg.png": "D'or à trois pals alésés, abaissés et fichés de gueules, surmontés d'un loup passant de sable.",
	"./armorial_files/100px-Blason_de_la_famille_Filhol.svg.png": "D'or à la fasce de gueules, accompagnée de trois hures de sanglier de sable.",
	"./armorial_files/100px-Blason_harol.svg.png": "D'azur à trois cloches d'argent.",
	"./armorial_files/100px-Blason_Famille_de_Blé.svg.png": "De gueules aux trois chevrons d'or.",
	"./armorial_files/100px-Blason_Famille_fr_de-Fleury.png": "D'azur, à trois roses d'or.",
	"./armorial_files/100px-Blason_fam_fr_Floquet_(du).svg.png": "D'azur, à la croix engrêlée d'or, acc. aux 1 et 4 d'une étoile d'argent et aux 2 et 3 d'une pomme de pin d'or.",
	"./armorial_files/100px-Blason_fam_fr_Flotte.svg.png": "De gueules, au lion d'or, armé et lampassé d'argent.",
	"./armorial_files/100px-Blason_famille_fr_(de)_Fontanges_de_Panat.svg.png": "De gueules, au chef d'or chargé de trois fleurs-de-lys d'azur.",
	"./armorial_files/Westfalen_Wappen_Forcade-Biaix.jpg": "Parti : au 1 d’argent au lion de gueules tenant un arbre de sinople ; au chef d’azur chargé de 3 étoiles du champ, au 2, coupé, d’argent à un château de 3 tours de gueules de sinople à 3 roses d’argent 2 et 1",
	"./armorial_files/Etienne_de_Forcade,_Ecr_Sr_de_Laubeyran,_démit_en_la_ville_de_Casteljaloux.jpg": "D'or à un senestrochère de carnation, armé de gueules, mouvant du bas du flanc sénestre de l'écu et tenant une épée de gueules, surmonté de deux vaches passantes du même, l'une au-dessus de l'autre, la vache inférieure sans tête",
	"./armorial_files/Blason_Forceville_en_Vimeu.svg.png": "De gueules au sautoir d'argent, cantonné de quatre merlettes du même.",
	"./armorial_files/100px-Blason_de_la_famille_Forget.svg.png": "D'azur au chevron d'or, accompagné de trois coquilles du même.",
	"./armorial_files/100px-Ecu_d'azur_à_l'aigle_d'or.svg.png": "et",
	"./armorial_files/100px-Blason_famille_fr_de-Foucaud-de-Launay.svg.png": "Un écu d'azur à une bande d'argent accompagnée à droite d'un anchre de même et à gauche d'un soleil d'or rayonnant; ledit écu timbré d'un casque de profil orné de ses lambrequins d'or, d'azur et d'argent",
	"./armorial_files/Blason_pays_fr_FranceAncien.svg.png": "D'azur semé de fleur de lys d'or.",
	"./armorial_files/100px-Blason_famille_fr_de-Foucher.svg.png": "De sable, au lion d'argent.",
	"./armorial_files/100px-Blason_famille_Fouquet.svg.png": "D'argent à un écureuil de gueules.",
	"./armorial_files/Famille_Frain_de_la_Gaulayrie.svg.png": "D'argent à trois molettes de de sable, au chef d'azur chargé de deux têtes et cols de cheval d'argent de profil",
	"./armorial_files/Famille_Frain_de_la_Motte.svg.png": "D'argent à trois molettes de de sable, au chef d'azur chargé de deux têtes et cols de cheval coupées d'or de profil",
	"./armorial_files/100px-Blason_Francqueville.svg.png": "D'azur à une étoile d'or accompagnée en chef d'un lambel du même à trois pendants",
	"./armorial_files/100px-Blason_famille_fr_de-Frézouls.svg.png": "D'azur au chef de sinople.",
	"./armorial_files/100px-Blason_Famille_Fr_Frotier.svg.png": "D'argent au pal de gueules accosté de dix losanges du même, ordonnés 2, 2 et 1 de chaque côté.",
	"./armorial_files/100px-Blason_famille_fr_Gaigne.svg.png": "D'azur au chevron d'or accompagné de trois molettes d'éperon colletées d'or, celle de la pointe soutenue d'un croissant d'argent",
	"./armorial_files/100px-Blason_famille_fr_de-Gaillarbois.svg.png": "d'argent, à six tourteaux de sable, 3, 2 et 1.",
	"./armorial_files/100px-Blason_Gaillard_de_Saint_Germain.svg.png": "D'or au chevron d'azur chargé de cinq besants d'argent et accompagné de trois hêtres arrachés de sinople.",
	"./armorial_files/Blason_famille_fr_du-Val-d'Episy.svg.png": "D'argent, à trois trèfles de sinople.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "d’argent à un bélier de sable passant ; au chef cousu d'azur chargé d'étoiles sans nombre",
	"./armorial_files/100px-Blason_Gallet.svg.png": "D'azur, au chevron d'or, chargé de trois roses de gueules.",
	"./armorial_files/Blason_famille_Gardey_de_Soos.svg.png": "Écartelé, au 1 et 4 d'azur à une colombe d'argent portant en son bec un rameau d'olivier de sinople, au 2 et 3 de gueules au lion d'or",
	"./armorial_files/Armoiries_Familiales.jpg": "D'azur, au croissant d'argent surmonté d'un lys d'or.",
	"aucune image": "Ecartelé : aux 1et 4, de gueules, au levrier courant d'argent, surmonté d'une tour crénelée du même ; au chef cousu d'azur, chargé de trois besants d'argent ; au 3 et 3 d'argent, à trois merlettes de sable, 2 et 1.",
	"./armorial_files/100px-Armes_Gasquet.png": "De sinople, au coq d'argent becqué, crêté, barbé et membré d'or ; au chef cousu d'azur, chargé d'un soleil levant d'or dissipant un nuage d'argent",
	"./armorial_files/100px-Blason_Famille_fr_de-Gaston_de_Pollier.png": "D'argent, à trois fasces de gueules accompagnées en pointe d'une corneille de sable, au chef d'azur chargé de trois étoiles d'argent.",
	"./armorial_files/100px-Blason_de_la_famille_de_Gaudemaris.svg.png": "D'or au coq de sable crété de gueules, posé sur une montagne de trois coupeaux d'azur, au chef du même chargé de trois étoiles du champ.",
	"./armorial_files/100px-Blason_de_la_famille_de_Gayardon_de_Grézolles.svg.png": "D'azur au lion d'argent armé, lampassé et couronné de gueules, accompagné de trois besants d'or.",
	"./armorial_files/100px-Blason_du_Marquis_de_gayardon_de_fenoyl.svg.png": "Écartelé : aux 1 et 4 d'azur au lion d'argent armé, lampassé et couronné de gueules, accompagné de trois besants d'or (de Gayardon), aux 2 et 3 d'azur au taureau furieux d'or, au chevron cousu de gueules brochant sur le tout (de Fenoyl).",
	"./armorial_files/100px-Blason_de_la_famille_de_Gayardon_de_Lévignen_(éteinte).svg.png": "D'azur au sautoir engrelé d’argent.",
	"./armorial_files/100px-Blason_famille_grassoise_GeoffroyduRouret.png": "Tranché de gueules et d'argent",
	"./armorial_files/100px-Blason_de_la_famille_Ginestet.svg.png": "D’argent, à trois molettes de gueules.",
	"./armorial_files/100px-Blason_deGigord(ancien).svg.png": "De gueules à la rose d'argent, au chef cousu d'azur chargé de trois merlettes d'argent.",
	"./armorial_files/100px-Blason_de_la_famille_Gillet_de_Chalonge.svg.png": "Parti au 1 de gueules à la croix alésée tréflée d'argent cantonnée de quatre molettes d'éperon d'or, au 2 d'azur au lion d'argent et à la bande cousue de gueules brochant sur le tout.",
	"./armorial_files/100px-Blason_deGinestoux.svg.png": "D'or au lion de gueules, armé, vilené et lampassé de sable.",
	"./armorial_files/100px-Blason_famille_fr_Godart-de-Vingré.svg.png": "D’or, à un chevron de gueules.",
	"./armorial_files/100px-Blason_fam_fr_Gontaut.svg.png": "Écartelé d'or et de gueules, l'écu en bannière.",
	"./armorial_files/100px-Blason_famille_it_Gonzaga10.svg.png": "Écartelé; au premier d’argent, à la croix pattée de gueules cantonnée de quatre aigles de sable éployées et affrontées; sur le tout, écartelé, au premier et au quatrième fascé d'or et de sable, au deuxième et au troisième de gueules au lion d'argent à la queue fourchée, armé et lampassé d'or, couronné et colleté du même, au bâton péri en bande; au deuxième d’Alençon; au troisième de Bourgogne ; au quatrième de Clèves chargé en cœur de La Marck; sur le tout d’Albret d’Orval",
	"./armorial_files/100px-Blason_famille_fr_Goullet_de_Rugy.svg.png": "Dʼazur au lion d'or grimpant une fontaine d'argent.",
	"./armorial_files/100px-Blason_Laurent_Gouvion-Saint-Cyr_(1764-1830).svg.png": "Coupé au 1, parti du franc-quartier des comtes militaires de l'Empire à une bordure en filet d'argent, et d'azur à une étoile d'or, au 2 de sable.",
	"./armorial_files/100px-Blason_Famille_fr_de-Gozon.svg.png": "De gueules, à la bande d'azur bordée d'argent, à la bordure componée d'argent.",
	"./armorial_files/Beauvoir_du_Roure.svg.png": "Écartelé aux 1 et 4 d'or au lion de gueules (de Beauvoir), aux 2 et 3 de gueules, endenché d'or de quatre pièces au chef (de Grimoard), sur le tout d'azur, au chêne d'or englanté d'or à trois racines et quatre branches passées en sautoir de même (du Roure).",
	"./armorial_files/100px-Blason_famille_fr_Goué.svg.png": "D'or au lion armé et lampassé de gueules, surmonté d'une fleur de lys d'azur.",
	"./armorial_files/100px-Blason_famille_fr_Goüin.svg.png": "D'azur à la croix tréflée d'or.",
	"./armorial_files/100px-Blason_Arthus_Gouffier_(+1519).svg.png": "D'or à 3 jumelles de sable posées en fasce.",
	"./armorial_files/100px-Blason_Famille_Gout_de_Vissac.svg.png": "D'azur, à deux chevrons d'or semés de fleurs de lys d'azur et accompagnés de trois étoiles d'or deux et une",
	"./armorial_files/Blason_fam_fr_Le_Gouvello.svg.png": "olim",
	"./armorial_files/100px-Goys.svg.png": "D'or, au chevron d'azur, chargé de trois fleurs de lys d'argent 1 et 2.",
	"./armorial_files/Famille_de_Grasse.svg.png": "D'or au lion de sable, couronné, armé et lampassé de gueules",
	"./armorial_files/100px-Armoiries_Studigel_de_Bitche.svg.png": "D'or, au lion d'azur, armé et lampassé de gueules.",
	"./armorial_files/Blason_Grenier.svg.png": "Parti de gueules à trois grenades versées d'or, ouvertes du champ, et d'azur au croissant d'argent",
	"./armorial_files/100px-Blason_famille_fr_de-Grimal.svg.png": "D'argent, à l'aigle éployée de sable, au chef d'azur chargé de trois étoiles d'argent.",
	"./armorial_files/100px-Blason_Monaco.svg.png": "Fuselé d'argent et de gueules.",
	"./armorial_files/100px-Grosourdy_de_Saint-Pierre.png": "De gueules à une fasce accompagnée en chef d'un croissant et en pointe de deux roses, le tout d'argent.",
	"./armorial_files/100px-Blason_fam_fr_Grouchy_(de).svg.png": "D'or fretté de six pièces d'azur, sur le tout d'argent à trois trèfles de sinople.",
	"./armorial_files/100px-Blason_famille_fr_Guibert.svg.png": "D'azur, au chevron d'or chargé d'une feuille de chêne de sinople.",
	"./armorial_files/100px-Blason_fam_fr_Guillard_de_la_Garenne-d'Arcy.svg.png": "De gueules, à deux bourdons de pèlerin d'or, posés en chevron, acc. de trois monts ou montjoyes d'argent.",
	"./armorial_files/100px-Blason_famille_fr_de-Guillaumont.svg.png": "Coupé de gueules sur azur par une fasce d'argent accompagnée en chef d'un lion naissant d'or et d'un bouquet de plumes d'autruche d'argent en pointe.",
	"./armorial_files/100px-Blason_famille_fr_de_Guillebon.svg.png": "D'azur à la bande d'or accompagnée de trois besants de même, deux en chef et un en pointe",
	"./armorial_files/Blason_famille_fr_Guillermo.svg.png": "D'argent à une plante de fougère de sinople, surmontées d'une étoile de gueules et accompagnée d'un croissant en pointe de même.",
	"./armorial_files/100px-Blason_famille_HAAG.svg.png": "D’azur, à une aigle bicéphale d’or éployée lampassée de gueules, accompagnée à dextre et à senestre de branches de laurier d'argent passées en sautoir et surmontée en chef d'une rose d'or boutonnée de gueules posées en fasce.[106]",
	"./armorial_files/100px-Blason_Famille_fr_Ham.svg.png": "D'or a trois croissant de gueules.",
	"./armorial_files/100px-Blason_famille_du_Hamel_de_Canchy.svg.png": "D'azur à la bande d'or, chargée de trois roses de gueules",
	"./armorial_files/100px-Blason_ville_fr_HangestSanterre_(Somme).svg.png": "D'argent à la croix de gueules, chargée de cinq coquilles d'or",
	"./armorial_files/Blason_ville_fr_Harcourt_(Eure).svg.png": "De gueules à deux fasces d'or.",
	"./armorial_files/100px-Blason_Harscouet.svg.png": "D'azur à trois coquilles d'argent.",
	"./armorial_files/100px-Blason_Philippe_Marie_Leclerc_de_Hautecloque_(1902-1947).svg.png": "D'argent à la croix de gueules chargée de cinq coquilles d'or.",
	"./armorial_files/100px-Blason_Maison_de_Hautemer.svg.png": "D'or, à trois fasces ondées d'azur.",
	"./armorial_files/100px-Blason_famille_fr_de_Hédouville.svg.png": "D'or au chef d'azur chargé d'un lion léopardé d'argent, lampassé de gueules.",
	"./armorial_files/100px-Blason_Marant.svg.png": "D'azur à la molette d'éperon d'or.",
	"./armorial_files/100px-Knize.png": "De gueules, à la bande d'or.",
	"./armorial_files/100px-Blason_fam_fr_Hennequin_d'Ecquevilly.svg.png": "Vairé d'or et d'azur; au chef de gueules, chargé d'un lion léopardé d'argent",
	"./armorial_files/100px-Blason_famille_fr_d'Herbais.svg.png": "D'argent au lion de gueules armé, couronné et lampassé d'or, à l'orle de huit coquilles d'azur.",
	"./armorial_files/100px-Blason_famille_fr_Héris.svg.png": "D’argent, à la bande d’azur, chargé de trois mollettes d’or, à la bordure engrêlée de gueules.",
	"./armorial_files/100px-Blason_famille_fr_Houdet.svg.png": "De gueules à la gerbe d'or, liée du même, surmontée de trois étoiles d'argent et accompagnée de trois billettes du même, deux en flancs et une en pointe.",
	"./armorial_files/100px-Blason_fam_fr_Hurault.svg.png": "D'or à la croix d'azur, cantonnée de quatre soleils non figurés de gueules.",
	"./armorial_files/100px-Blason_famille_fr_Huvier-du-Mée.svg.png": "D'azur, à la fasce d'or, chargée d'une couleuvre ondoyante d'azur, et accompagnée de trois colombes d'argent.",
	"./armorial_files/Blason_Jacquin_de_Margerie.png": "D'argent au chevron de gueules, accompagné en chef de 2 trèfles de sinople, et en pointe d'une tête de loup de sable percée d'un dard du même.",
	"./armorial_files/100px-Blason_fam_bzh_Janvier_de_La_Motte.svg.png": "D'azur, à un vol d'argent[6].",
	"./armorial_files/Blason_famille_fr_Joseph_(Normandie).svg.png": "Parti, au premier écartelé d'azur et d'or, au second d'argent à la barre de sable.",
	"aucune image": "Origine :",
	"./armorial_files/100px-BVlason_fam_fr_Jourda_de_Vaux.svg.png": "D'or, à la bande de gueules, chargée de trois croissants d'argent, les cornes dirigées vers le canton dextre du chef.",
	"./armorial_files/100px-Blason_famille_fr_de_Jouvencel.svg.png": "D'or, à deux palmes adossées de sinople, mouvant d'un croissant de gueules, au chef d'azur chargé d'un soleil d'or accosté de deux étoiles d'argent.",
	"./armorial_files/100px-Blason_famille_fr_de-Joybert.svg.png": "D'argent au chevron d'azur surmonté d'un croissant de gueules et accompagné de trois roses de même.",
	"./armorial_files/100px-Blason_de_la_famille_Juhé_de_Barenton.svg.png": "D'argent au chevron de gueules, accompagné de trois étoiles de même.",
	"./armorial_files/100px-Jullien_de_goupillières.svg.png": "D'azur à une épée d'argent accostée de deux lions affrontés d'or rampants contre l'épée.",
	"./armorial_files/Blason_famille_fr_de_Julien_de_Zélicourt.svg.png": "De gueules au sautoir d'argent, sommé d'un chef d'azur chargé de trois étoiles d'or.",
	"./armorial_files/6124-jourdes_2.png": "D'argent à la fasce ondée de sable, aux 2 merlettes en chef, et à la fleur de lys en pointe, le tout du même",
	"./armorial_files/100px-Kererault.svg.png": "D'azur fretté d'argent à une fleur-de-lis du même au point du chef.",
	"./armorial_files/100px-Kergorlay.svg.png": "Vairé d'or et de gueules.",
	"./armorial_files/Blason_de_la_famille_de_Kerscao2.svg.png": "D'azur à trois têtes d'aigles, arrachées d'or.",
	"./armorial_files/100px-Blason_fam_es_Fortia_(selon_Gelre).svg.png": "D’argent à trois fasces de sable.",
	"./armorial_files/100px-Armes_Kermel.jpg": "De gueules à la fasce d'argent, accompagné de deux léopards d'or, un en chef et un en pointe.",
	"./armorial_files/100px-Armes_Kermenguy.png": "Losangé d'argent et de sable, à la fasce de gueules brochant chargée d'un croissant d'argent.",
	"./armorial_files/100px-Blason_Famille_Kermoysan.svg.png": "De gueules, à sept coquilles d’argent posées 3, 3, 1.",
	"./armorial_files/100px-Blason_de_la_famille_de_Kerouallan.svg.png": "D'azur à dix étoiles d'argent.",
	"./armorial_files/Blason_famille_fr_Kerouartz.svg.png": "D'argent à la roue à cinq rais de sable, accompagnée de trois croisettes de même.",
	"./armorial_files/100px-Kersaintgilly.svg.png": "De sable à six trèfles d'argent.",
	"./armorial_files/120px-Blason_Famille_Kersauzon.svg.png": "De gueules au fermail d'argent, l'ardillon posé en fasce.",
	"./armorial_files/100px-Kersulguen.svg.png": "D'or au lion de gueules (Pont-l'Abbé) au franc-quartier écartelé d'or et de gueules.",
	"./armorial_files/100px-Blason_famille_fr_de-Laage-de-Meux.svg.png": "D’azur, au chevron d’or, accompagné en chef de deux roses tigées et feuillées du même, et en pointe d’une main fermée soutenant un faucon, le tout d’or.",
	"./armorial_files/100px-Blason_Louis_César_de_La_Baume-le-Blanc_(1708-1780).svg.png": "Coupé d'or sur gueules au léopard lionné de sable sur l'or et d'argent sur le gueules.",
	"./armorial_files/100px-Blason_famille_Labaume-Montrevel.svg.png": "D'or, à la bande vivrée d'azur.",
	"./armorial_files/100px-Blason_famille_Labaume-Pluvinel.svg.png": "D’or, à la bande vivrée d’azur, accompagné en chef d'une moucheture d'hermine de sable.",
	"./armorial_files/100px-La_Baume_de_Suze.svg.png": "D'or, à trois chevrons de sable ; au chef d'azur, chargé d'un lion issant d'argent couronné d'or.",
	"./armorial_files/100px-Blason_famille_de_la_Bourdonnaye-Blossac-fr.svg.png": "De gueules à trois bourdons d'argent posés en pals.",
	"./armorial_files/104px-Blason_ville_fr_Verteillac_(Dordogne).svg.png": "D'or au chêne arraché de sinople, englanté du champ ; au chef d'azur chargé de trois étoiles d'or",
	"./armorial_files/115px-Blason_ville_fr_Verteillac_(Dordogne).svg.png": "D'or au chêne arraché de sinople, englanté du champ ; au chef d'azur chargé de trois étoiles d'or",
	"./armorial_files/100px-Blason_fam_fr_La_Châtre.svg.png": "De gueules à la croix ancrée de vair.",
	"./armorial_files/100px-La-Chevardière-de-La-Grandville.png": "D'argent à la fougère de sinople.",
	"./armorial_files/100px-Blason_famille_fr_Chouë_de_La_Mettrie.png": "D'argent à trois chouettes de sable becquées et membrées de gueules.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "D'argent au palmier naturel arraché issant d'un croissant de sable, surmonté d'un chef de gueule chargé de trois étoiles du champ d'or.",
	"./armorial_files/100px-Blason_Famille_fr_de_La_Croix_de_Castries.svg.png": "D'azur à la croix d'or.",
	"./armorial_files/100px-Blason_famille_La_Croix_de_Ravignan.svg.png": "D'azur à la croix d'or, cantonnée de quatre roses du même.",
	"./armorial_files/La_Crompe.svg.png": "D'azur au chevron d'or accompagné en pointe d'un lion du même, et de trois étoiles d'argent en chef.",
	"./armorial_files/Blason_famille_La_Cropte_de_Chantérac.svg.png": "D'azur, à la bande d'or, accompagnée de deux fleurs de lys de même.",
	"./armorial_files/100px-Blason_famille_fr_Lacvivier.svg.png": "D’azur, au cygne d'argent, ou lac ou vivier de même, adextré de trois étoiles d'or en franc quartier, deux et une. Au chef cousu d'azur, chargé de trois croisettes d'argent mises en fasce.",
	"./armorial_files/100px-Blason_famille_fr_La-Faye.svg.png": "De gueules, à la fasce d’or, accompagnée en chef d’une croix fleuronnée et en pointe d’une tour, le tout d’or.",
	"./armorial_files/100px-Blason_famille_fr_Laffon_de_Labedat.svg.png": "D'azur, à une fontaine d'argent jaillissante surmontée d'un soleil d'or, accompagné de deux ancres aussi d'argent.",
	"./armorial_files/Jean_la_Forcade_coat_of_arms.jpg": "D’azur, à deux lions adossés d'or, armés et lampassés de gueules rampant chacun contre une colonne d'argent mise vers le bord de l'écu",
	"./armorial_files/Armand_de_Forcade.jpg": "Écartelé au 1 d'argent à un lion de gueules, armé et lampassé de sable, aux 2 et 3 d'azur à trois étoiles d'or, au 4 d'argent à trois bandes de gueules",
	"./armorial_files/100px-Blason_de_la_Forest.svg.png": "De sinople à la bande d'or frettée de gueule",
	"./armorial_files/Blason_Fr_famille_Lafourcade_(Bayonne).svg.png": "D'or à une fourche de sable emmanchée de gueules.",
	"./armorial_files/Blason_famille_lagarde.svg.png": "D'azur à deux chevrons d'or, accompagnés de trois quintefeuilles du même.",
	"./armorial_files/Blason_famille_fr_de_lagarde_berry.svg.png": "olim",
	"./armorial_files/100px-Blason_Famille_Lagarde.svg.png": "olim",
	"./armorial_files/Blason_famille_fr_delagarde1.svg.png": "De gueules à trois croix ancrées d'argent, au chef cousu de sable chargé d'un croissant aussi d'argent.",
	"./armorial_files/La_Garde.svg.png": "D'azur au chef d'argent",
	"./armorial_files/Blason_famille_fr_de_lagarde_montlezun.svg.png": "olim",
	"./armorial_files/100px-Blason_fr_famille_La_Garde_de_Saignes.svg.png": "D'azur à l'épée d'argent en bande",
	"./armorial_files/100px-Blason_famille_fr_Laguarigue_de_Survilliers.svg.png": "De gueules à trois têtes de lion d'or.",
	"./armorial_files/100px-Blason_ville_fr_Souday_(LoirCher).svg.png": "olim",
	"./armorial_files/Blason_la_hause.png": "Coupé de gueules à la fleur de lys d'or et d'argent aux deux étoiles d'azur.",
	"./armorial_files/100px-La_Haye_des_fosses.svg.png": "D'argent au chevron de gueules accompagné de trois grenades fermées feuillées et tigées de sinople.",
	"./armorial_files/100px-Blason_famille_fr_Laisné_de_Torchamps.svg.png": "d'azur, au chevron d'or accompagné de deux étoiles de même en chef, et d'un croissant d'argent en pointe[120].",
	"./armorial_files/100px-Blason-Famille_fr_Laisné_blason_a_l'aigle_avant_1450_(Normandie).svg.png": "d'azur à l'aigle d'or becquée et membrée de gueules",
	"./armorial_files/100px-Lajoumard_de_bellabre.svg.png": "olim",
	"./armorial_files/100px-Blason_famille_fr_de_Lalanne_de_Souye.svg.png": "D'azur, à deux épées nues d'argent à la garde d'or en pointe, croisées en sautoir ; au chef chargé de trois étoiles d'argent 2 et 1.",
	"./armorial_files/100px-Blason_Lalau_Keraly.svg.png": "D'azur à la fleur de lys d'or accompagnée de trois coquilles d'argent.",
	"./armorial_files/Ecu_de_Lamare_de_Chenevarin.png": "Porte d'azur à la croix d'or cantonnée au I. d'une licorne contournée d'argent, au 2. d'un aigle d'or membré et becqué de gueulles, au 3. et dernier de deux lions affrontés d'or armés et lampassés de gueulles, les queues passées en sautoir.",
	"./armorial_files/100px-Blason_famille_Lambert_(_Anjou_).svg.png": "De gueules au chevron d'or accompagné de deux croissants d'argent en chef et d'un gland d'or en pointe.",
	"./armorial_files/100px-Blason_de_lambert_des_champs_de_morel_3D.svg.png": "De gueules à chevron d'or accompagné en chef de deux croissants d'argent et un pointe d'un chêne arraché d'or.",
	"./armorial_files/100px-Blason_Famille_de_Lambert_des_Granges-1-.svg.png": "D'argent à la fasce de gueules, accompagnée en chef de trois étoiles d'azur et en pointe d'un lion léopardé armé et lampassé de gueules",
	"./armorial_files/100px-Blason_famille_fr_Lamyn.svg.png": "D'argent à un cœur de gueules, accompagné en chef de deux étoiles d'azur et en pointe d'une main apaumée de carnation",
	"./armorial_files/104px-Landes_d'Aussac_de_Saint_Palais.png": "D’azur à la bande",
	"./armorial_files/100px-Blason_fam_bzh_Lannion_(de).svg.png": "D'argent, à trois merlettes de sable, au chef de gueules chargé de trois quintefeuilles du champ[6] (sceau de 1569[32]).",
	"./armorial_files/100px-Armoiries_de_Lannoy.svg.png": "D'argent à trois lions de sinople, armés et lampassés de gueules, couronnées d'or",
	"./armorial_files/100px-Blason_deLantivy.svg.png": "D’azur, à 8 billettes d’or, 3, 3, 2, 2 et 1, au canton de gueules chargé d’une épée d’argent.",
	"./armorial_files/100px-Blason_Lantivy-Leviston.svg.png": "D'argent à trois carreaux de gueules 2 et 1.",
	"./armorial_files/Blason_famille_fr_Laplane.svg.png": "De gueules au cygne d'argent.",
	"./armorial_files/100px-Blason_La_Rochefoucauld.svg.png": "Burelé d'argent et d'azur de dix pièces, à trois chevrons de gueules brochant sur le tout, le premier écimé.",
	"./armorial_files/100px-Blason-de-la-roque-Latour.svg.png": "Écartelé au 1 et 4 de gueules à la tour d'argent;au 2 et 3 d'azur bandé d'or",
	"./armorial_files/100px-Blason_famille_fr_Lassarat.svg.png": "D’argent, mantelé d’azur au faisceau de verges au naturel lié d'argent accosté de deux roses d’argent en chevron renversé tigées de sinople et boutonnées d’or, mouvant à dextre et à senestre. Au chef de gueules chargé de trois roses d’argent ornées de sinople et boutonnées d’or.",
	"./armorial_files/Blason_famille_de_La_Selle.png": "De sable au croissant d'or accompagné de trois quintefeuilles du même.",
	"./armorial_files/100px-Blason_famille_La_Selve_du_Fain.svg.png": "D'argent, au lion de gueules.",
	"./armorial_files/100px-Blason_Famille_fr_de-Lastic.svg.png": "De gueules, à la fasce d'argent.",
	"./armorial_files/100px-Blason_famille_fr_de-la-Taille.svg.png": "De sable, au lion d'or armé et couronné du même et lampassé de gueules.",
	"./armorial_files/100px-Blason_fam_FRA_la_Trémoille.svg.png": "D'or au chevron de gueules, accompagné de trois aiglettes d'azur, becquées et membrées de gueules.",
	"./armorial_files/100px-Blason_fam_FRA_Lattre_de_Tassigny_(de).svg.png": "D'azur à la fasce d'or accompagnée en chef de trois étoiles et en pointe de trois canes toutes d'argent et posées en fasce.",
	"./armorial_files/100px-Blason_Famille_fr_de-Laudun.svg.png": "D'azur au sautoir d'argent, au chef de vair.",
	"./armorial_files/100px-Blason_famille_fr_de_Launay_(tournaisis).svg.png": "parti-émanché d'argent et de sable de 8 pièces",
	"./armorial_files/100px-Blason_fam_fr_L'Aubespine_(de).svg.png": "D'azur, au sautoir alésé d'or, cantonné de quatre billettes du même.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "Écartelé au 1 et 4 d’azur à deux truites adossées d’argent, écaillées de gueules, cantonnées de quatre croisettes recroisetées d’argent, au pied fiché d’or (de Chiny), au 2 et 3 de sable à trois herses d’argent (de Laval ou de La Vaulx), sur le tout de sable à trois tours d’argent.",
	"./armorial_files/100px-Lavieu.svg.png": "De gueules, au chevron d'or.",
	"./armorial_files/100px-Famille_de_Laval.svg.png": "D'or, à la croix de gueules chargée de cinq coquilles d'argent et cantonnée de seize alérions d'azur.",
	"./armorial_files/100px-Blason_famille_le_Bas_du_Plessis.svg.png": "D'or au lion rampant de gueules accompagné de trois peupliers de sinople.",
	"./armorial_files/100px-Blason_famille_fr_Le-Breton-de-Vannoise.svg.png": "D'argent, à trois roses de gueules. Supports: deux lévriers d'argent, colletés d'azur.",
	"./armorial_files/100px-Blason_famille_Le-Clément-de-Taintégnies.svg.png": "De gueules à 3 trèfles d’or, au chef d’argent, chargé de 3 merlettes de sable",
	"./armorial_files/100px-Blason_fam_fr_Le_Cirier_de_Neufchelles.svg.png": "D'azur, à trois licornes d'or.",
	"./armorial_files/100px-Blason_fam_fr_Leclerc_de_Juigné.svg.png": "D'argent, à la croix de gueules, bordée-engrêlée de sable et cantonnée de quatre aigles du même, becquées et armées du second.",
	"./armorial_files/100px-Blason_famille_fr_Le_Courtois_du_Manoir.svg.png": "D'azur à la fasce d'or accompagnée, en chef, de trois étoiles rangées et, en pointe, de trois canettes nageant sur des ondes mouvant de la pointe, le tout d'argent.",
	"./armorial_files/100px-Blason_Novion-Porcien.svg.png": "D'azur à la croix d'argent, fleurdelisée d'or.",
	"./armorial_files/100px-Blason_famille_fr_Lefebvre_de_Ram.svg.png": "De gueules au chevron d'or accompagné en chef de deux maillets d'argent posés en pal et en pointe d'une tête de bélier arrachée du même.",
	"./armorial_files/100px-Blason_ville_fr_Ormesson-sur-Marne_(Val-de-Marne).svg.png": "D'azur, à trois lys de jardin d'argent, tigées et feuillés de sinople posés en pal.",
	"./armorial_files/100px-Le_Flo_de_Branho.svg.png": "D'argent à trois trèfles de sinople.",
	"./armorial_files/100px-Blason_de_la_famille_de_Kerangal.svg.png": "olim",
	"./armorial_files/Blason_famille_Le_Jolis_de_Villiers.svg.png": "D'azur au chevron d'or accompagné de trois aigles d'argent, les vols abaissés.",
	"./armorial_files/100px-Blason_fam_fr_Le_Menestrel_1.svg.png": "D'or, au chevron d'azur, acc. en chef de deux chênes arrachés de sinople, et en pointe d'une tortue de sable armée de gueules.",
	"./armorial_files/100px-Blason_Famille_fr_Le-Moniès-de-Sagazan.svg.png": "De gueules à trois bandes d'or, au chef d'azur, chargé d'un soleil d'or.",
	"./armorial_files/100px-Blason_Comte_de_Léon.svg.png": "D'or à un lion morné de sable.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "D'azur à la fasce d'argent, chargée d'un croissant de gueule, accompagné de trois étoiles d'or, deux en chef et une en pointe.",
	"./armorial_files/100px-Blason_de_la_famille_de_Lesseps.svg.png": "D'argent à un cep de vigne de sinople fruité de deux grappes de raisins de sable, accosté de deux champignons du second, le tout soutenu d'une terrasse du même et accompagné d'un soleil rayonnant de gueules mouvant du canton senestre.",
	"./armorial_files/100px-Blason_famille_fr_de_Lestendart.svg.png": "D'argent au lion de sable à queue fourchée, lampassé et armé de gueules, chargé sur son épaule d'un écusson d'argent à 3 fasces de gueules.",
	"./armorial_files/100px-Blason_famille_fr_Le-Saulnier-de-Saint-Jouan.svg.png": "D'azur à trois poissons d'or posés en fasce.",
	"./armorial_files/100px-Blason_famille_fr_de-Lestang.svg.png": "D'or a une scie de sable posée en bande.",
	"./armorial_files/100px-Blason_Famille_Lestrange.svg.png": "De gueules à deux lions adossés d'or, surmontés d'un léopard d'argent.",
	"./armorial_files/100px-Blason_ville_fr_Chaville_(Hauts-de-Seine).svg.png": "D'azur, à trois lézards d'argent, posés en pal ; au chef cousu de gueules, chargé de trois étoiles d'or.",
	"./armorial_files/100px-Blason_famille_fr_de_Guillebon.svg.png": "D'azur à la bande d'or accompagnée de trois besants de même, deux en chef et un en pointe",
	"./armorial_files/Blason_famille_fr_Le_Tonnelier_de_Breteuil.svg.png": "D'azur à l'épervier essorant d'or, longé et grilleté de même.",
	"./armorial_files/100px-Blason_famille_fr_Le-Vaillant.svg.png": "D'azur, au dextrochère mouvant d'une nuée d'argent, paré de gueules, tenant une épée en pal, aussi d'argent, garnie d'or.",
	"./armorial_files/100px-Blason_famille_fr_Leveque.svg.png": "De gueules à l'Agneau pascal d'argent, la croix enrubannée d'azur ; au chef cousu d'azur chargé d'un besan à dextre d'argent.",
	"./armorial_files/100px-Blason_famille_Levesque-de-Pouilly.svg.png": "d’azur à un chevron d’or, accompagné en chef de deux étoiles du même, et en pointe d’un cœur aussi d’or",
	"./armorial_files/107px-Blason_famille_fr_Lévis.png": "D'or à trois chevrons de sable.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "D'azur à 1 aigle d'or, et un chef cousu de gueules chargé d'un croissant d'argent accosté de 2 étoiles d'or.",
	"./armorial_files/100px-Blason_famille_L_Hariton.svg.png": "D'azur au chevron d'or accompagné en chef de trois étoiles d'argent rangé en fasce et en pointe d'un pin du second.",
	"./armorial_files/100px-Blason_famille_fr_de-Lichy.svg.png": "D'azur à la bande d'argent accostée de trois losanges d'or, un et deux.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "Ecarlaté,1 de sable, un lion d'azur *, couronné d'or, 2 d'azur, une épée en pale aussi de gueule *, garnie d'or.",
	"./armorial_files/100px-Blason_de_l'Isle_de_Lalande.svg.png": "D'argent à trois roses de gueules.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "D'azur à deux bandes d'or, au chef du même chargé de trois molettes de sable.",
	"./armorial_files/100px-Blason_famille_fr_de-Loménie.svg.png": "D’or, à un arbre de sinople, posé sur un tourteau de sable, au chef d’azur, chargé de trois losanges d’argent.",
	"./armorial_files/100px-Blason_famille_fr_de_Longueau_Saint_Michel.svg.png": "D’azur fretté d'argent de six pièces.",
	"./armorial_files/Blason_Lorgeril.png": "De gueules au chevron d'argent chargé de cinq mouchetures d'hermine de sable et accompagné de trois molettes d'or, deux en chef et une en pointe.",
	"./armorial_files/100px-Blason_famille_fr_de_Loriol.svg.png": "D'azur à la tour d'argent senestrée d'un avant-mur, tous deux d'argent maçonnés et ajourés de sable.",
	"./armorial_files/100px-Blason_famille_fr_de-Lossendière.svg.png": "D'azur au chêne d'or posé sur une terrasse du même.",
	"./armorial_files/100px-Blason_de_la_famille_Loz_de_Coëtgourhant.svg.png": "De gueules à trois éperviers d'argent becqués membrés et grilletés d'or.",
	"./armorial_files/100px-Blason_Lubersac.svg.png": "De gueules au loup passant d'or.",
	"./armorial_files/100px-Blason_Frolois_54.svg.png": "Bandé d’or et d’azur de six pièces, à la bordure engrelée de gueules.",
	"./armorial_files/100px-Blason_ville_fr_Lugny_(Saône-et-Loire)2.svg.png": "D'azur à trois quintefeuilles d'or, accompagnées de sept billettes de même, trois rangées en chef, une en cœur, et trois en pointe.",
	"./armorial_files/100px-Blason_famille_fr_Lux.svg.png": "Écartelé au 1 d’or à trois pals de gueules, au 2 d’azur à la tête de licorne d’argent, au 3 d’azur à l’aigle éployée d’argent, au 4 de gueules, au léopard couronné d’or.",
	"./armorial_files/100px-Luzy_de_Pelissac.svg.png": "Parti au 1 d'or à la fasce échiquetée d'argent et de gueules de trois tires, au 2 de gueules au chevron d'argent accompagné de trois étoiles d'or.",
	"./armorial_files/Blason_fam_irl-fr_Mac_Mahon_(de)_1.svg.png": "D'argent, à trois lions léopardés de gueules regardants, armés et lampassés d'azur, passant l'un sur l'autre.",
	"./armorial_files/100px-Madaillan.svg.png": "Tranché d'or et de gueules.",
	"./armorial_files/100px-Blason_Famille_fr_de-Maffre.svg.png": "De gueules, au chef cousu d'azur chargé de trois croissants d'argent.",
	"./armorial_files/100px-Magnin-Valerian.svg.png": "D'azur au chevron d'or, accompagné de trois coquilles du même.",
	"./armorial_files/100px-Blason_de_la_famille_Mahé_de_Berdouaré.svg.png": "D'argent aux deux haches adossées surmontées d'un croissant, le tout de gueules.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "olim",
	"./armorial_files/100px-Blason_famille_fr_de_Maillan_Ségur.svg.png": "D'azur, à un annelet d'or accompagné de trois molettes de même, 2 et 1.",
	"./armorial_files/100px-Blason_fam_FRA_de_Maillé.svg.png": "D'or à trois fasces nébulées de gueules.",
	"./armorial_files/100px-Blason_famille_fr_de_Maintenant.svg.png": "De gueules, à la hure de sanglier d'or, accompagnée de trois losanges d'argent.",
	"./armorial_files/100px-Le_Maistre_de_Normanville.png": "De gueules à la bande d'argent, accompagné en chef d'un soleil d'or et en pointe d'une rose du même",
	"./armorial_files/Armoiries_de_la_Famille_de_mandon.svg.png": "olim",
	"./armorial_files/104px-Armoiries_MANDON.svg.png": "Écartelé ; aux 1 et 4, de gueules semé de fleur de lys d'or à un lion d'or ; aux 2 et 3, d'argent à une bande de gueules chargée de trois roses d'argent.",
	"./armorial_files/100px-Blason_de_la_famille_marié_de_l'Isle.svg.png": "D'azur au chevron d'or surmonté en chef d'un croisant de lune d'argent accompagné de deux roses au naturel, et en pointe une foi de carnation surmontée d'une colombe d'argent tenant en son bec un rameau d'olivier de sinople.",
	"./armorial_files/Blason_à_dessiner.svg(5).png": "Écartelé aux 1 et 4 d’or au lion rampant de sable, lampassé de gueules, au chef d’azur chargé de trois étoiles du premier (de Marmiesse), aux 2 et 3 d’argent à la fasce de gueules, accompagnée de trois merlettes de sable, deux en chef et une en pointe (d'Esparbès de Lussan).",
	"./armorial_files/100px-FamilleMarquet.png": "olim",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "De gueules à trois alérions d'or volant sur trois ondes de même.",
	"./armorial_files/Blason_de_Martin_du_Tyrac_de_Marcellus.svg.png": "D'azur, à la tour donjonnée à dextre d'argent, maçonnée de sable.",
	"./armorial_files/100px-Blason_famille_du-Mas.svg.png": "De gueules à la tour d'argent",
	"./armorial_files/100px-Blason_famille_fr_de-Massac.svg.png": "Echiqueté d'azur et d'or, de seize points, chaque point chargé d'une étoile de l'un à l'autre.",
	"./armorial_files/Blason_famille_fr_de_Massol.svg.png": "Coupé au 1 d'or à l'aigle éployé de sable armé et lampassé de gueules (Autriche), au 2 de gueules au dextrochère armé d'une masse (alias marteau d'arme), mouvant d'une nuée à senestre, le tout d'argent.",
	"./armorial_files/100px-Blason_de_la_famille_de_Mauduit_du_Plessis.svg.png": "d'or au chevron d'azur accompagné de trois molettes de sable.",
	"./armorial_files/100px-Blason_famille_fr_Maulmont.svg.png": "D'azur à deux fasces d'or.",
	"./armorial_files/100px-Ecu_d'argent_au_croissant_de_gueules.svg.png": "D'argent au croissant de gueules.",
	"./armorial_files/Blason_famille_fr_de_Maupeou.svg.png": "D'argent au porc-épic de sable.",
	"./armorial_files/Blason_de_la_famille_de_Mauroy.svg.png": "D’azur au chevron d’or accompagné de trois couronnes royales du même.",
	"./armorial_files/100px-Blason_de_la_famille_des_Mazis.svg.png": "De gueules à la fasce d'or chargée de trois molettes d'éperon de sable.",
	"./armorial_files/100px-Ancien_blason_famille_de_Meaux.svg.png": "Ancien: De sable à la jumelle d'argent",
	"./armorial_files/Blason-famille-fr-de-Méjanès-(M-GOTHIQUE).svg.png": "De gueules plain à la filière d'or ; sur le tout, d'or, au chevron écimé de gueules accompagné de deux étoiles et d'un M en pointe, le tout du mesme.",
	"./armorial_files/100px-Blason_famille_fr_de_Mello.svg.png": "D'or, à deux fasces de gueules, accompagné de neuf merlettes du même, rangées en orle.",
	"./armorial_files/100px-Blason_fam_fr_Melun.svg.png": "D'azur aux neuf besants d'or et au chef du même.",
	"./armorial_files/100px-Blason_famille_de_Mengin-Fondragon.svg.png": "D'azur, à la fasce d'or accompagnée en chef d'un griffon du même, naissant à mi-corps de la fasce.",
	"./armorial_files/Blason_gueules-bande_or.svg.png": "De gueules, à la bande d'or.",
	"./armorial_files/100px-Blason_deMenthon.svg.png": "De gueules au lion d'argent, à la bande d'azur brochant sur le tout.",
	"./armorial_files/100px-Blason-famille-merle.svg.png": "D'or à la tour d'argent accompagnée de quatorze merlettes de sable bequées d'or.",
	"./armorial_files/100px-Blason_famille_fr_du_Merle.svg.png": "De gueules à trois quintefeuilles d'argent.",
	"./armorial_files/100px-Blason_famille_fr_Merle-de-la-Brugière-de-Laveaucoupet.svg.png": "D'azur à la merlette d'argent, coupé d'argent au lion de sable issant lampassé de gueules et couronné d'or.",
	"./armorial_files/100px-Blason_famille_fr_Mermier.svg.png": "D'azur à une foi d'argent, accompagnée de trois grenades d'or, ouvertes de gueules.",
	"./armorial_files/100px-Mevouillon.svg.png": "D'hermine au chef d'or chappé de gueules.",
	"./armorial_files/100px-Blason_famille_Michel_de_Cambernon.svg.png": "D'azur à la croix d'or, cantonnée de quatre coquilles du mesme.",
	"./armorial_files/100px-Blason_famille_Millanois_de_la_Salle.svg.png": "D'argent au lion de gueules portant un écusson écartelé au 1 et 4 d'or à trois pals de gueules et au 2 et 3 d'or à la croix de sable.",
	"./armorial_files/100px-Blason_deMiolans.svg.png": "Bandé de gueules et d'or.",
	"./armorial_files/100px-Blason_de_la_famille_Miorcec_de_Kerdanet.svg.png": "D'azur un hérisson d'or, au chef d'argent chargé de trois mouchetures de sable.",
	"./armorial_files/100px-Blason_Famille_fr_de_Mollerat_du_Jeu.svg.png": "D'argent à la bande d'azur chargée de trois mollettes d'argent et accostée de deux cotises du second.",
	"./armorial_files/100px-Blason_famille_fr_de-Monléon.svg.png": "Parti: au premier, d'argent à une croix latine de sable haussée sur un mont de trois coupeaux mouvant de la pointe du même ; au second, de gueules au lion d'or.",
	"./armorial_files/100px-Montaigne_de_Poncins.png": "D'or à trois bandes engrelées de gueules.",
	"./armorial_files/100px-Blason_deMontalais.svg.png": "D'or à trois chevrons d'azur à la fasce de gueules brochante.",
	"./armorial_files/100px-Blason_ville_fr_Montalembert_(Deux-Sèvres).svg.png": "D'argent, à la croix ancrée de sable.",
	"./armorial_files/100px-Blason_famille_fr_de-Montault.svg.png": "Losangé d'argent et d'azur.",
	"./armorial_files/100px-Blason_famille_de_Montbellet.svg.png": "De gueules à trois tours d’or, deux en chef et une en pointe.",
	"./armorial_files/100px-Blason_de-Montcalm_Gozon.svg.png": "Écartelé au 1 d'azur à trois colombes d'argent becquées et membrées de gueules, aux 2 et 3 de sable à la tour d'argent sommée de trois tourelles de même, aux 4 de gueules à la bande d'azur bordée d'argent (de Gozon).",
	"./armorial_files/100px-Blason_Famille_Monteclerc.svg.png": "De gueules au lion d'or, couronné et lampassé du même.",
	"./armorial_files/100px-Blason_fam_fr_Montesquiou.svg.png": "D'or aux deux tourteaux de gueules, l'un sur l'autre.",
	"./armorial_files/100px-Armoiries_seigneurs_Montfort.svg.png": "de gueules au lion d'argent à la queue fourchée",
	"./armorial_files/100px-Blason_fr_famille_de_Montgolfier.svg.png": "D'argent à une montagne de sinople, mouvante du côté droit, au pied de laquelle est une mer d'azur, aussi mouvante de la pointe de l'écu, et en chef, un globe aérostatique de gueule, ailé de même : le dit écu timbré d'un casque de profil orné de ses lambrequins d'argent, d'azur, de gueules et sinople.",
	"./armorial_files/100px-Montholon.png": "D'azur à un mouton d'or, accompagné de trois quintefeuilles d'argent rangées en chef",
	"./armorial_files/100px-Blason_Mathieu_II_de_Montmorency.svg.png": "D'or à la croix de gueules cantonnée de seize alérions d'azur ordonnés 2 et 2.",
	"./armorial_files/100px-Blason_Famille_de-Mostuéjouls.svg.png": "De gueules, à la croix fleurdelisée d'or, cantonnée de quatre billettes du même.",
	"./armorial_files/100px-Blason_fam_fr_Motier_de_La_Fayette.svg.png": "De gueules à la bande d’or et à la bordure de vair.",
	"./armorial_files/100px-Blason_de_la_famille_Mourain.svg.png": "D'azur au chevron acc en chef de deux étoiles et en pointe d'un croissant le tout d'or.",
	"./armorial_files/100px-Blason_famille_Muguet.svg.png": "D'azur au phénix d'or sur son immortalité de gueules fixant un soleil d'or mouvant du franc canton.",
	"./armorial_files/Armes_Mulsant.png": "D'azur au chevron d'or et au chef de même.",
	"./armorial_files/100px-Blason_Famille_Muzillac.svg.png": "De gueules, au léopard lionné d'hermine.",
	"./armorial_files/100px-Blason_famille_Nanton.svg.png": "De sinople à la croix d'or.",
	"./armorial_files/100px-Vicomtes_de_Narbonne.svg.png": "De gueules plein.",
	"./armorial_files/100px-Blason_fr_de_Nattes.svg.png": "De gueules à trois nattes d'or mises en fasces.",
	"./armorial_files/100px-Blason_Famille_Naundorff-de_Bourbon.svg.png": "D'azur à un sacré-cœur rayonnant de gueules accompagné de trois fleurs de lys d'or.",
	"./armorial_files/100px-Blason_fam_FRA_Neufville_de_Villeroy.svg.png": "D'azur au chevron d'or, accompagné de trois croisettes ancrées du même.",
	"./armorial_files/100px-Blason_Michel_Ney_(1769-1815).svg.png": "D'or à l'écusson d'azur chargé d'une orle d'or et accosté de deux mains tenant des badelaires et adossées de sable, à la bordure d'azur et au chef brochant des ducs de l'Empire (alias des princes de l'Empire).",
	"./armorial_files/100px-Blason_de_la_Maison_de_Nicolaï.svg.png": "D'azur au lévrier courant d'argent, colleté d'un collier de gueules, bordé et bouclé d'or.",
	"./armorial_files/100px-Blason_ville_fr_Niort-de-Sault_(Aude).svg.png": "De gueules à la croix alaisée d'or.",
	"./armorial_files/Armoiries_nissirios.png": "D'azur à une Île volcanique d'or accompagnée de trois croix allésées dites grecques d'argent; à la bordure ondée d'or chargée de sept croisettes d'azur.",
	"./armorial_files/104px-Blason_fam_fr_Noailles.svg.png": "De gueules à la bande d'or.",
	"./armorial_files/100px-Blason_fam_fr_Nompère_de_Champagny_(de).svg.png": "D'azur, à trois chevrons brisés d'or.",
	"./armorial_files/100px-Blason_ville_fr_oise_marquéglise.svg.png": "De gueules, à la fleur-de-lis d'or.",
	"./armorial_files/100px-Les_armoiries_de_la_famille_Œsinger.jpg": "D’azur à deux fasces d’or en chef et une tête de lion du même en pointe lampassée de gueules.",
	"./armorial_files/100px-Blason_d'Ollone.svg.png": "D'azur, au lion d'or à la queue fourchue nouée et passée en sautoir, à la divise d'argent, et surmontée de trois étoiles d'or.",
	"./armorial_files/100px-Blason_famille_fr_Olphe-Galliard.svg.png": "D’azur au coq d’or, crêté, becqué, barbé et membré de gueules ; au chef d'argent chargé d'un croissant de sable",
	"./armorial_files/100px-Blason_ville_fr_Cuiseaux_(Saône-et-Loire).svg.png": "D'or à trois chevrons de gueules.",
	"./armorial_files/100px-Blason_famille_fr_d'ORR.svg.png": "Fascé d'or et de gueules de quatre pièces, à la bande ondée d'azur brochant sur le tout, chargé de trois poissons d'argent dans le sens de la bande.",
	"./armorial_files/100px-Blason_Famille_fr_D'orge.svg.png": "Parti : au 1 d'or au lion d'azur, au 2 à la tour ajourée et au chef échiqueté de six points.",
	"./armorial_files/100px-Blason_famille_fr_d'Orgemont.svg.png": "D'azur à trois épis d’orge d’or mis en pal.",
	"./armorial_files/100px-Blason_Alphonse_d'Ornano.svg.png": "Écartelé aux 1 et 4 de gueules à la tour donjonnée d'or, maçonnée de sable, aux 2 et 3 d'or au lion de gueules, au chef d'azur chargé d'une fleur de lys d'or.",
	"./armorial_files/100px-Blason_famille_fr_d'Ourches_(1).svg.png": "D'or au lion de sable.",
	"./armorial_files/100px-Blason_famille_fr_Palluat-de-Besset.svg.png": "De gueules, à un fer de lance d’argent, la pointe en bas, aboutissant à un croissant montant de même, et soutenu d’un lion d’or et d’une aigle d’argent affrontés, le lion à dextre et l’aigle à senestre, au chef cousu d’azur, chargé d’une rose d’argent accostée de deux étoiles d’or.",
	"./armorial_files/100px-Blason_Maison_de_Panat.svg.png": "D'argent, au sautoir de gueules.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "D'azur à sept épis de millet d'or, recourbés, 4, 2 et 1.",
	"./armorial_files/100px-Blason_Panon_Desbassayns_de_Richemont.png": "D’or à la fasce d’azur chargée de deux paille-en-queues au naturel allant de dextre à senestre, accompagnée en chef d’une main dextre de carnation",
	"./armorial_files/100px-Blason_de_la_famille_de_Pardieu_(Normandie).svg.png": "D'or, au lion couronné de gueules.",
	"./armorial_files/100px-Blason_famille_fr_de-Pardieu.svg.png": "De gueules au sautoir d'or, accompagné de quatre aiglettes du même.",
	"./armorial_files/Armoirie_des_marquis_de_Parseval.svg.png": "D'argent, à un pal de sable chargé de trois étoiles d'argent.",
	"./armorial_files/100px-Armes_de_Passorio_Peyssard.jpg": "D'or à trois bandes ondées de sinople.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "D'or à la bande de gueules, chargée d'un berger d'argent, adextre un chien du même, couché sur une terrasse aussi d'argent, la tête contournée.",
	"./armorial_files/100px-Blason_Hambye.svg.png": "D'or à deux fasces d'azur accompagné de 9 merlettes de gueules en orle, 4,2 et 3",
	"./armorial_files/100px-Blason_famille_de_Namur.png": "D'or au lion de sable, armé, lampassé et couronné de gueules.",
	"./armorial_files/100px-Blason_de_la_famille_du_Peloux_de_Saint_Romain.svg.png": "D'argent au sautoir engrélé d'azur.",
	"./armorial_files/100px-Blason_fam_fr_Le_Peletier_de_Rosanbo.svg.png": "D'azur à la croix pattée d'argent chargée en cœur d'un chevron de gueules, accosté de deux molettes d'éperon de sable, et en pointe, d'une rose de gueules.",
	"./armorial_files/Blason_Martainville-Épreville.svg.png": "D’argent à la fasce d’azur chargée de trois besants d’or.",
	"./armorial_files/Blason_famille_fr_Penfentenyo.svg.png": "Burelé de dix pièces de gueules et d'argent.",
	"./armorial_files/Penmarch.svg.png": "Écartelé aux 1 et 4 de gueules à une tête de cheval d'argent (Penmarc'h) aux 2 et 3 d'or à trois colombes d'azur (Colombien) Ou D'or à la fasce d'azur acc de six colombes du même.",
	"./armorial_files/100px-Blason_fam_fr_Percin_(de).svg.png": "D'azur, à un cygne d'argent nageant sur des ondes du même, et surmonté de trois molettes d'or, rangées en chef.",
	"./armorial_files/100px-Blason_Famille_fr_Pérusse_des_Cars_(pal_de_vair).svg.png": "De gueules au pal de vair.",
	"./armorial_files/100px-Blason_famille_fr_Perrier.svg.png": "D'argent au poirier terrassé de sinople, fruité d'or.",
	"./armorial_files/100px-Blason_famille_fr_de_Petiti.svg.png": "D'or à l'aigle de sable, éployée, armée et languée de gueules.",
	"./armorial_files/Blason_famille_fr_de-Peyre.svg.png": "Écartelé aux 1 et 4 d'azur à la croix alésée d'or, aux 2 et 3 d'or à la fleur de pensée au naturel, feuillée de sinople.",
	"./armorial_files/Blason_famille_Phelippes_de_La_Marnierre.svg.png": "D'azur, au chevron d'or surmonté d'une étoile du même, accostée de deux merlettes d'argent, et un croissant du même en pointe.",
	"./armorial_files/100px-Blason_famille_fr_Piéchaud.svg.png": "D'Azur au soleil d'or, au chef cousu de gueules, chargé de deux têtes de lévriers d'argent, naissantes et hissantes de la section, et surmontées d'une étoile du même à cinq raies.",
	"./armorial_files/100px-Armes_Piedelièvre.png": "D'argent à deux lièvres de gueules passant l'un sur l'autre.",
	"./armorial_files/100px-Blason_famille_fr_de-Pierre-de-Bernis.svg.png": "D'azur à la bande d'or, accompagnée en chef d'un lion passant de même armé et lampassé de gueules.",
	"./armorial_files/100px-Blason_famille_de-Chambrun.svg.png": "D'azur à trois pommes de pin d'or, les queues en bas.",
	"./armorial_files/100px-Blason_famille_fr_de-Piolenc.svg.png": "De gueules à six épis de froment d'or 3, 2 et 1 à la bordure engrêlée du même.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "D'argent à la bande d'azur frettée du champ et accompagnée de six merlettes de sable rangées en orle.",
	"./armorial_files/100px-Blason_des_Plantadis.jpg": "D'argent au chêne de sinople, glandé d'or, au chef d'azur chargé d'un croissant d'argent accosté de deux étoiles d'or.",
	"./armorial_files/100px-Blason_famille_fr_de-Plantin-de-Villeperdrix.svg.png": "D'or au chevron de gueules accompagné de trois arbres arrachés de sinople ; au chef d'azur chargé d'un lion léopardé d'or, armé et lampassé de gueules.",
	"./armorial_files/100px-Blason_duPlessis-deJarze.svg.png": "Écartelé au 1 et au 4 de gueules à un massacre de cerf d'argent surmonté de deux croissants du même l'un sur l'autre, aux 2 et au 3 d'argent à une bande fuselée de gueules, à la bordure de sable chargée de huit besants d'or.",
	"./armorial_files/100px-Blason_Famille_fr_du_Poerier_de_Portbail.svg.png": "D'azur au chevron d'or, accompagné en chef de deux étoiles d'argent, et d'un croissant du même en pointe.",
	"./armorial_files/100px-Polier_2_-_Tyroff_AT.jpg": "D'argent, chargé d'un coq hardi de sable, crêté, barbé et membré de gueules",
	"./armorial_files/100px-Blason_famille_fr_de-Polier.svg.png": "D'argent, au coq hardi de sable, becqué, crêté et membré de gueules.",
	"./armorial_files/100px-Blason_famille_Polignac.svg.png": "Fascé d'argent et de gueules",
	"./armorial_files/100px-Blason_fam_fr-can_Pollet_de_La_Combe_de_La_Pocatière.svg.png": "De sable à deux étoiles d'or rangées en fasce.",
	"./armorial_files/Blason_Famille_fr_de-Gaston-de-Pollier.png": "D'argent, à trois fasces de gueules accompagnées en pointe d'une corneille de sable au chef d'azur chargé de trois étoiles d'argent.",
	"./armorial_files/100px-Blason_famille_fr_du-Pontavice.svg.png": "D'argent à un pont de trois arches de gueules, maçonné de sables.",
	"./armorial_files/Pontevès.png": "De gueules au pont à deux arches d'or.",
	"./armorial_files/Blason_famille_Ponroy.svg.png": "D'azur à la croix haussée fichée dans un cœur d'or, et une étoile de même en chef.",
	"./armorial_files/100px-Blason_famille_fr_Porquet.svg.png": "D'or, au cœur de gueules, une étoile d'azur en chef, et une croix raccourcie du même en pointe",
	"./armorial_files/100px-Blason_famile_fr_Poterat.svg.png": "De gueules au chevron d'or accompagné de trois étoiles du même, deux en chef et une en pointe.",
	"./armorial_files/Blason_famille_fr_Poulpiquet2.svg.png": "D'azur à trois pallerons d'argent, becqués et membrés de gueules.",
	"./armorial_files/Famille_Pouriatz_(Haut-Anjou).svg.png": "D'argent à la bande d'azur, chargée de trois étoiles d'or.",
	"./armorial_files/Blason_famille_fr_Poute_de_Puybaudet.svg.png": "D'argent à trois pals de sable, au chevron de sable brochant.",
	"./armorial_files/100px-Blason_famille_fr_de_Provençal-de-Fonchâteau.svg.png": "D'or au chevron d'azur accompagné de trois batons écotés de gueules",
	"./armorial_files/100px-Armoiries_Puiset.svg.png": "D'argent au lion de gueules, armé et lampassé d'or",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "parti, au premier : de gueules au lion d'or ; au chef d'argent chargé de trois glands de sinople, les queues en bas : au deuxième, reparti : a)d'azur au lion contourné d'or : b)de sinople à une panthère rampant d'argent, tachetée de sable",
	"./armorial_files/100px-Blason_ville_fr_Argent-sur-Sauldre_(Cher).svg.png": "Parti au 1 d'azur à la bande d'or chargé de trois cosses de pois de sinople, au 2 d'argent à la fasce de sinople accompagnée de trois trèfles du même.",
	"./armorial_files/100px-Armoiries_de_la_famille_Prévost.jpg": "De gueules au lion d'or tenant de la dextre un rameau de laurier posé en barre et incurvé vers la senestre, accompagné en chef de deux soleils, le tout d'or, à la filière du même",
	"./armorial_files/100px-Blason_de_-Prévinquières-Varès.svg.png": "Ecartelé : au 1 d'argent, à deux branches de pervenche de sinople en forme de couronne; au 2 de France, au bâton d'or péri en bande ; au 3 d'azur, semé de fleurs-de-lis et de besants d'or à la tour d'argent, maçonnée de sable, à la cotice de gueules, brochant sur le tout ; au 4 de gueules, à trois besants d'argent.",
	"./armorial_files/100px-Blason_Famille_fr_de-Prévinquières_Montjaux.svg.png": "Ecartelé; au 1 d'or au lion de sable couronné, allumé, armé et lampassé de gueules; au 2 d'azur à trois montagnes d'argent surplombées de trois fleurs d'or 2 et 1 ; au 3 d'azur à deux lions d'or affrontés; au 4 d'azur à trois étoiles d'or 2 et 1 ; brochant le tout, un écu d'argent à deux rameaux de pervenche de sinople passés en sautoir.",
	"./armorial_files/100px-Blason_de_la_famille_des_Prez_de_la_Morlais.png": "D'argent au croissant de sable accompagné de quatre fusées de gueules en chef et de quatre fusées du même en pointe",
	"./armorial_files/100px-Blason_famille_fr_de-Prie.svg.png": "De gueules à trois tiercefeuilles d'or ; au chef d'argent, chargée d'une aiglette de sable.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "olim",
	"./armorial_files/100px-Blason_Famille_fr_Puel_d'Elbesset.png": "D'or, au pal de sinople, chargé en chef d'une rose d'argent.",
	"./armorial_files/Blason_famille_fr_de-Puivert.svg.png": "D'argent à six mouchetures d'hermines.",
	"./armorial_files/100px-Blason_famille_fr_Quatrebarbes.svg.png": "De sable à la bande d'argent accompagnée de deux cotices de même.",
	"./armorial_files/100px-Blason_ville_fr_Malestroit_(Morbihan).svg.png": "De gueules à neuf besants d'or 3, 3 et 3, l'écu surmonté de trois tours.",
	"./armorial_files/100px-Blason_Maison_du_Quélennec.svg.png": "D'hermine, au chef de gueules chargé de trois fleurs de lys d'or.",
	"./armorial_files/100px-Blason_famille_de_Namur.png": "D'or au lion de sable, armé, lampassé et couronné de gueules.",
	"./armorial_files/100px-Blason_famille_de_Raffin.svg.png": "D'azur au chevron d'or accompagné de trois écrous de même.",
	"./armorial_files/100px-Blason-Ranon.svg.png": "D'azur au cygne d'argent, au chef de gueules chargé de trois quintefeuilles aussi d'argent.",
	"./armorial_files/100px-Blason_Armoiries_Famille_fr-Rapeaud.png": "D'azur au lion d'argent.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "d’azur, à la mer d’argent, mouvante de la pointe, de laquelle est un thon de sable, dans une mer d’argent, au chef du second, chargé d’un rat passant de sable",
	"./armorial_files/Blason_famille_fr_Ravel_d'Esclapon.svg.png": "D'azur aux deux chevrons d'argent accompagnés en chef de deux besants du même, au chef d'or chargé d'une étoile de gueules",
	"./armorial_files/100px-Blason_Famille_fr_de-Raxi.svg.png": "Gueules à la bande ondée d’argent, au chef d’or chargé d’une aigle éployée de sable, couronnée de même, membrée et becquée de gueules. Timbre : Couronne royale à l’antique à pointes aigües. L’écu est adossé à un trident dont les pointes surpassent la couronne.",
	"./armorial_files/73px-Blason_famille_fr_de-Reboul.svg.png": "Rebulli",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "d'argent à neuf clochettes de sable ordonnées en orle et au lion de gueules brochant",
	"./armorial_files/Blason_DE_RESTAURAND.svg.png": "D'argent à un phénix sur son immortalité, fixant un soleil, le tout au naturel.",
	"./armorial_files/Blason_famille_fr_de_Reydet.svg.png": "D'azur, à la fasce d'or, accompagnée en chef de deux étoiles du même et en pointe d'un croissant d'argent.",
	"./armorial_files/100px-Blason_famille_fr_Richard_de_Ruffey.svg.png": "D'azur, au chef d'or, chargé de trois tourteaux de gueules.",
	"./armorial_files/100px-Blason_famille_fr_de_Soultrait.svg.png": "D'argent à deux palmes adossées de sinople, accompagnées en pointe d'une grenade de gueules, tigée et feuillée du second émail.",
	"./armorial_files/Blason_famille_fr_de_Rieu.svg.png": "olim",
	"./armorial_files/100px-Blason_famille_fr_du_Rieu.svg.png": "De sinople, à deux pals d'argent, à deux fasces de gueules brochant sur le tout.",
	"./armorial_files/100px-Blason_famille_fr_Jean_IV_de_Rieux.svg.png": "D'azur, à dix besants d'or, 4, 3, 2 et 1.",
	"./armorial_files/100px-Blason_famille_fr_Rillart_de_Verneuil.svg.png": "D'azur au lion d'argent, au chef d'argent chargé de trois merlettes de sable.",
	"./armorial_files/100px-Blason_famille_fr_de-Ripert.svg.png": "D'azur à la fleur de lys d'or, à la fasce de gueules brochant sur le tout, chargée d'un croissant contourné d'argent à dextre et d'un soleil d'or à senestre.",
	"./armorial_files/Blason_famille_fr_de-Ripert-d'Alauzier.svg.png": "Écartelé : aux 1 et 4, d'azur à la fleur de lys d'or, à la fasce de gueules brochant sur le tout, chargée d'un croissant contourné d'argent à dextre et d'un soleil d'or à senestre, qui est de Ripert ; au 2 et 3 d'azur à la bordure d'or chargée d'une croix épiscopale de gueules brochant sur le tout, qui est d'Alauzier",
	"./armorial_files/100px-Blason_fam_it-fr-be_Riquet(ti).svg.png": "D'azur à la bande d'or accompagnée en chef d'une demi-fleur de lys d'or défaillante à dextre fleuronnée du même et en pointe de trois roses d'argent rangées en orle.",
	"./armorial_files/100px-Blason_famille_fr_Roberge_de_Boismorel.svg.png": "D’azur au chevron d’or accompagné en chef de deux étoiles et en pointe d’un croissant, le tout d’argent",
	"./armorial_files/100px-Blason_famille_fr_Robin.svg.png": "De gueules à trois fers de piques d'argent pointes en bas",
	"./armorial_files/Blason_de_la_famille_de_Robineau_de_Villemont.svg.png": "D'or au chevron d'azur accompagné en chef de 2 roses de gueules et en pointe d'un arbre de sinople.",
	"./armorial_files/100px-Heraldique_couronne_comte_français.svg.png": "D'azur, au chevron d'or, accompagné de trois molettes du même.",
	"./armorial_files/100px-Blason-Rochechouart.svg.png": "Fascé ondé et enté d'argent et de gueules de six pièces, entées de l'une à l'autre.",
	"./armorial_files/100px-Rocheguyon.svg.png": "D'azur à trois bandes d'or et à la bordure de gueules.",
	"./armorial_files/100px-Rocquigny.png": "d'argent à 3 fers de lance, émoussés de sable placés 2 et 1 les pointes en bas",
	"./armorial_files/100px-Rodez.svg.png": "De gueules, au léopard lionné d'or.",
	"./armorial_files/100px-Blason_fam_fr_Rohan.svg.png": "De gueules à neuf macles d'or, posées 3, 3, 3.",
	"./armorial_files/100px-Blason_famille_fr_de-Roncherolles.svg.png": "D’argent, à deux faces de gueules.",
	"./armorial_files/100px-Roquefeuil.svg.png": "De gueules à une cordelière d'or passée en sautoir.",
	"./armorial_files/100px-De_Roquefeuil-Anduze.svg.png": "Écartelé, aux 1 et 4 de gueules à trois étoiles d'or (d'Anduze), aux 2 et 3 de gueules à la cordelière d'or passée en sautoir (de Roquefeuil).",
	"./armorial_files/100px-De_Roquefeuil_Versols.svg.png": "De gueules à trois cordelières d'argent passées en sautoir, 2 et 1.",
	"./armorial_files/100px-De_Roquefeuil-Blanquefort.svg.png": "Contre-fascé d'or et de gueules de quatre pièces, chaque demi-fasce de gueules chargée d'un nœud de cordelière d'or, et chaque demi-fasce d'or chargée d'un nœud de cordelière de gueules.",
	"./armorial_files/100px-De_Roquefeuil-Roquefeuil.svg.png": "D'azur, à la cordelière d'or passée en sautoir.",
	"./armorial_files/100px-Blason_de-Roquefeuil_de_Monvert.svg.png": "Échiqueté d'or et de gueules de quatre tires.",
	"./armorial_files/100px-Blason_de_Roquefeuille.svg.png": "Échiqueté d'or et de gueules, au chef d'or chargé d'un loup passant d'azur.",
	"./armorial_files/100px-Blason_Famille_fr_de-Roquemaurel.svg.png": "D'azur, aux trois rocs d'échiquier d'or, au chef d'argent chargé d'un lévrier passant de sable.",
	"./armorial_files/100px-Blason_Famille_fr_Rosset-de-Rocozels-de-Fleury.png": "Écartelé; au 1 d'argent à une branche de rosier de sinople fleuri de trois pièces de de gueules, qui est de ROSSET ; au 2 de gueules, au lion d'Or, qui est de LASSET ; au 3 contre-écartelé, aux 1 et 4 d'argent et aux 2 et 3 de sable, qui est de VISSEC de LATUDE ; au 4 d'azur, aux trois rocs d'échiquier d'Or qui est de ROCOZEL ; et sur le tout d'azur, à trois roses d'Or qui est de FLEURY. L'écu environné du manteau de pair surmonté d'une couronne ducale.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "D'azur à la fasce en divise d'or, accompagnée en pointe d'une roue de huit raies du même.",
	"./armorial_files/100px-Blason_Robert_II_de_Pierrepont.svg.png": "D'or au lion d'azur, armé et lampassé de gueules",
	"./armorial_files/100px-Blason_Famille_Rougé.svg.png": "De gueules à la croix pattée et alésée d'argent.",
	"./armorial_files/100px-Armes_de_Rougemont_primitives.jpg": "olim",
	"./armorial_files/100px-Blason_famille_fr_de_Rougetb.png": "D'or, à trois rougets (chabots) de gueules rangés en fasce[191],[182].",
	"./armorial_files/100px-Blason_famille_Rougier.svg.png": "D'azur au sautoir d'argent chargé de cinq roses de gueules.",
	"./armorial_files/100px-Blason_famille_fr_Saint_Simon.svg.png": "Écartelé aux 1 et 4 échiqueté d'or et d'azur, au chef d'azur, chargé de trois fleurs de lys d'or (de Vermandois Saint Simon), aux 2 et 3 de sable à la croix d'argent, chargé de cinq coquilles de gueules (de Rouvroy).",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "D'argent à une fasce d'azur chargée de deux étoiles d'or, accompagnée en chef d'un lion de gueules, et en pointe d'un croissant du second.",
	"./armorial_files/100px-Blason_de_la_famille_Roy_de_lachaise.svg.png": "D'azur au chevron d'or accompagné de trois rencontres de buffle du même.",
	"./armorial_files/100px-Blason_ville_fr_Fourquevaux_(Haute-Garonne).svg.png": "De gueules à la bande d'argent.",
	"./armorial_files/100px-Famille_Ruault.svg.png": "Palé d'or et d'azur de six pièces.",
	"./armorial_files/100px-Blason_Famille_fr_de_ruffray.png": "D'argent à la guivre de sable lampassée de gueules posée en barre et à trois glands de sinople avec chatons de sanguine dont un au canton dextre du chef un au flanc senestre de l'écu et un en pointe[193].",
	"./armorial_files/100px-Blason_famille_fr_de-Ruielle.svg.png": "D'argent à la face bretessée et contrebretessée de gueules.",
	"./armorial_files/100px-Blason_Rumet.svg.png": "De sable à trois molettes d'éperon, à cinq pointes d'argent.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "D'azur à l'aigle d'or.",
	"./armorial_files/100px-Surcouf.svg.png": "D'argent au chevron de sable chargé de trois pétoncles d'or, au chef de sable chargé d'un lion passant d'or",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "D'azur aux trois étoiles mal-ordonnées d'or.",
	"./armorial_files/100px-Armoiries_Famille_de_Sablé.svg.png": "d'or à l'aigle d'azur becquée et membrée d'argent.",
	"./armorial_files/100px-Blason_famille_fr_Sabran.svg.png": "De gueules au lion d'argent.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "Écartelé aux 1 et 4 de gueules au lion d'argent (Sabran), aux 2 et 3 contre-écartelé de gueules au pont de deux arches d'or maçonné de sable (Pontevès), et d'or au loup ravissant d'azur, armée et lampassé de gueules (Agoult).",
	"./armorial_files/100px-Blason_famille_fr_Sade01.svg.png": "De gueules à l’étoile à huit rais d’or, chargée d’une aigle impériale éployée de sable, membrée, becquée, onglée, diadémée de gueules.",
	"./armorial_files/100px-Blason_famille_fr_Saguez-de-Breuvery.svg.png": "D'azur, au chevron d'or, accompagné de trois cors de chasse d'argent virolés et liés d'or.",
	"./armorial_files/Blason_fam_fr_Saint-George_(de).svg.png": "Écartelé: aux 1 et 4, d'argent, à la croix de gueules ; aux 2 et 3, fascé ondé enté d'argent et de gueules de six pièces (de Rochechouart).",
	"./armorial_files/100px-Armoiries_Saintignon.jpg": "De gueules à trois tours d'or, ajourées et maçonnées de sable.",
	"./armorial_files/100px-Arms_of_St_Leger.svg.png": "D'azur fretté d'argent au chef d'or.",
	"./armorial_files/100px-Blason_de_la_famille_de_saint-pezran.svg.png": "De sable à la croix pattée d'argent.",
	"./armorial_files/100px-Blason_ville_fr_La_Guerche-sur-l'Aubois_(Cher).svg.png": "D'or à la croix ancrée de sinople.",
	"./armorial_files/100px-Armes_famille_de_Saint_Vincent.png": "De gueules au dextrochère d'argent, chargé de trois bracelets d'azur et tenant une épée haute d'argent, montée d'or et supportant une couronne de lauriers du même.",
	"./armorial_files/100px-Salaun.svg.png": "D'argent à la hure de sanglier arrachée de sable défendue d'argent et couronnée d'or.",
	"./armorial_files/100px-Blason_famille_salaun.svg.png": "D'argent, à une épée d'azur, la pointe en bas, accostée de deux croissants adossés de gueules.",
	"./armorial_files/100px-Blason_deSales.svg.png": "D'azur, à deux fasces d'or, chargées chacune d'une autre fasce de gueules, accompagnées d'un croissant d'or en chef et de deux étoiles à six rais d'or en cœur et en pointe.",
	"./armorial_files/100px-Blason_fam_fr_Sallonier_de_Chaligny.svg.png": "D'azur, à une salamandre d'or, sur son brasier de gueules.",
	"./armorial_files/100px-Blason_famille_fr_Salgues_de_Lescure.svg.png": "Écatelé; aux 1 et 4 d'Or; aux 2 et 3 de gueules.",
	"./armorial_files/Blason_Famille_de_Salnove.svg.png": "Palé d'argent et de gueules de six pièces, à la bande d'or brochant sur le tout.",
	"./armorial_files/100px-Blason_Sampigny.svg.png": "De gueules au sautoir d'argent.",
	"./armorial_files/100px-Blason_Maison_de_Sancerre.svg.png": "D'azur, à une bande d'argent, accompagnée de deux cotices potencées et contre-potencées d'or (Champagne), au lambel de gueules, brochant sur le tout.",
	"./armorial_files/100px-Blason_sarcus.svg.png": "De gueules au sautoir d’argent cantonné de quatre merlettes de même.",
	"./armorial_files/100px-Blason_famille_Saulx-Tavannes.svg.png": "D'azur, au lion d'or couronné, lampassé, armé de gueules.",
	"./armorial_files/100px-Blason_Famille_fr_de-Saunhac.png": "D'or, au lion de sable gueulé, armé, lampassé et couronné de gueules; accompagné de douze carreaux de même ordonnés en orle.",
	"./armorial_files/100px-Blason_de-Scorailles.svg.png": "D'azur, à trois bandes d'or.",
	"./armorial_files/100px-Sdemartinville.svg.png": "D'or, à trois têtes de lion de gueules arrachées et languées d'azur.",
	"./armorial_files/100px-Blason_fam_fr_Ségur_(de).svg.png": "Écartelé aux 1 et 4 de gueules au lion d'or, aux 2 et 3, d'argent plain.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "Ecartelé aux 1 et 4 d'azur au sautoir d'or (de Seignard), aux 2 et 3 d'azur à l'aigle éployée d'argent (de La Fressange)",
	"./armorial_files/100px-Blason_Selve.svg.png": "D'azur à deux fasces ondées d'argent",
	"./armorial_files/200px-Blason_famille_fr_Selve2.svg.png": "D'azur, à 2 fasces ondées d'argent accolé d'argent à 3 trèfles de sinople",
	"./armorial_files/200px-Blason_famille_fr_Selve4.svg.png": "D'argent à 3 pals de sable accolé d'azur à 2 fasces ondées d'argent",
	"./armorial_files/100px-Blason_famille_fr_Selve3.svg.png": "D'azur à trois fasces ondées d'argent",
	"./armorial_files/100px-Blason_famille_fr_Selves.svg.png": "Parti d’azur à la tour d’argent et de gueules à deux fasces d’or",
	"./armorial_files/100px-Blason_Famille_fr_de-Selves.svg.png": "De gueules, à 3 pals d'or, à la bordure d'Hermine",
	"./armorial_files/Blason_de_la_famile_de_Semallé.svg.png": "D'argent à la bande de gueules, accompagnée d'un faucon de sable armé d'or grimpant.",
	"./armorial_files/Senesclauze.svg.png": "Équipolé de cinq points de gueules et de quatre d'argent",
	"./armorial_files/100px-Blason_Semur_Brionnais.svg.png": "D'argent à trois bandes de gueules.",
	"./armorial_files/100px-Blason_Famille_fr_de-Senvensa.svg.png": "D'azur, au pairle d'argent accompagné en chef d'une merlette d’or.",
	"./armorial_files/100px-Blason_famille_fr_de_Serres.svg.png": "D'argent au chevron d'azur, chargé de trois étoiles d'or, et accompagné de trois trèfles de sinople, deux en chef et un en pointe",
	"./armorial_files/100px-Blason_famille_fr_Sesmaisons.svg.png": "De gueules à trois tours de maisons d'or.",
	"./armorial_files/100px-Blason_deSeyssel.svg.png": "Gironné d'or et d'azur de huit pièces",
	"./armorial_files/Blason_fr_famille_de_Sèze_avant_1817.svg.png": "D’azur, à trois tours d'argent, rangées en fasce, accompagnées en chef de deux étoiles d’or et en pointe d’un croissant de même.",
	"./armorial_files/100px-Blason_famille_fr_de-Sillol.svg.png": "D'azur a la bande d'or, chargée de trois tètes d'aigles de sable languées de gueules",
	"./armorial_files/100px-Silly.svg.png": "D'hermine à la fasce ondée de gueules accompagné en chef de trois annelets rangés de même",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "Écartelé au 1 d'or, au 2 de gueules à l'étoile d'or, au 3 d'azur, au 4 d'argent, à la croix de sinople brochant sur le tout.",
	"./armorial_files/99px-Blason_Sins.jpg": "coupé au premier d'or chargé d'une fleur lys sable, au second de gueules",
	"./armorial_files/100px-Solages.svg.png": "D'azur au soleil agissant d'or.",
	"aucune image": "D'or, à l'écusson de gueules, chargé de trois têtes de léopards du premier.",
	"./armorial_files/100px-Blason_famille_fr_de-Sorbier-d'Isnard.svg.png": "D'argent au lion léopardé d'azur, armé, lampassé et cournonné de gueules",
	"./armorial_files/100px-Blason_de_la_famille_de_Suremain.svg.png": "D'azur au chevron d'or soutenu d'une main d'argent.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "olim",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "olim",
	"./armorial_files/100px-Blason_famille_fr_de-la-Taille.svg.png": "De sable, au lion d'or armé et couronné du même et lampassé de gueules.",
	"./armorial_files/100px-Blason_département_fr_Dordogne.svg.png": "De gueules, à trois lionceaux d'or, armés, lampassés et couronnés d'azur.",
	"./armorial_files/Blason_famille_fr_Tardieu.svg.png": "Coupé au premier d'or, à la fasce de sable; au deuxième de sinople, à l'écureuil d'argent.",
	"./armorial_files/100px-Blason_Famille_fr_Tascher_de_La_Pagerie.svg.png": "D'argent, à trois fasces d'azur, chacune chargée de trois flanchis du champ, surmontées de deux soleils de gueules[6],[202],[203],[204],[12],[205].",
	"./armorial_files/100px-Blason_famille_fr_Tassin_de_Charsonville.png": "D'argent, au chevron d'azur, sommé d'un croissant de sable, et accompagnées en chef de deux étoiles de sable, et en pointe d'une aigle essorante de mesme, le chef contourné. L'écu est surmonté d'une couronne de comte et supporté par un lion assis et un lion couché",
	"./armorial_files/Blason_de_la_famille_Taxis_de_Digne.jpg": "D'or coupé d'un trait. Le premier chargé d'une aigle double éployée de sable naissante du coupé, le second d'un taisson de sable.",
	"./armorial_files/100px-Blason_Teilhard_de_Nozerolles.svg.png": "D'or au chêne de sinople sommé de flammes de gueules et terrassé du même au chef cousu d'azur chargé de trois étoiles du champ",
	"./armorial_files/Blason_famille_du_Teilhet_de_Lamothe.png": "D'argent au tilleul de sinople terrassé de même, accosté en chef de deux étoiles de gueules",
	"./armorial_files/100px-Blason_famille_fr_Terrasson.svg.png": "Parti : au 1, d'azur, à trois croissants d'argent adossés et entrelacés, accompagnés de trois étoiles d'or, deux en chef et une en pointe (qui est Terrasson, de Lyon) ; au 2, d'azur, à la bande d'argent, chargée de trois bouquets de lauriers de sinople (qui est Fougères, en basse Auvergne).",
	"./armorial_files/100px-Blason_famille_de_Terris.svg.png": "D'or à 3 taupes se terrissant de sable",
	"./armorial_files/100px-Tersac.svg.png": "d'or au chef de sable chargé de deux besants d'or.",
	"./armorial_files/100px-Blason_famille_fr_Testo-Ferry.svg.png": "d'azur à la fasce d'or accompagnée en chef d'une tête de profil casquée d'or accostée de deux étoiles d'argent et en pointe d'un lion passant d'or, armé et lampassé de gueules tenant dans sa patte dextre une épée d'argent",
	"./armorial_files/100px-Blason_de_la_famille_Testard_du_Cosquer.svg.png": "D'argent au lion de gueules.",
	"./armorial_files/100px-Blason_famille_grassoise_Theas.png": "D'azur, à l'arbre terrassé d'or sommé de flammes de gueules contre un Griffon d'or",
	"./armorial_files/100px-Blason_deThiers.svg.png": "D'or au lion de gueules",
	"./armorial_files/100px-Blason_fam_fr_Thiboutot.svg.png": "D'argent, au sautoir denché de gueules.",
	"./armorial_files/100px-Thimerais.svg.png": "D'or, à l'étoile à huit branches de gueules.",
	"./armorial_files/100px-Thynieres.svg.png": "D'or, à la croix ancrée d'azur.",
	"./armorial_files/100px-Blason_famille_fr_Porquet.svg.png": "D'or, au cœur de gueules, une étoile d'azur en chef, et une croix raccourcie du même en pointe",
	"./armorial_files/100px-Blason_famille_fr_Thouéry.svg.png": "D'argent à trois bandes de gueules",
	"./armorial_files/100px-Blason_famille_fr_Thouars.svg.png": "D'or semé de fleurs de lys d'azur, au franc-quartier de gueules.",
	"./armorial_files/100px-Blason_famille_fr_de-Thoury.svg.png": "D'azur au rencontre de cerf d'argent, accompagné en chef de quatre bâtons fleurdelysés d'or posés en escarboucle (raie d'escarboucle), et en pointe de deux fleurs de lys du même.",
	"./armorial_files/100px-Armoiries_Famille_de_Toroge.svg.png": "d'argent à la tour de gueules crénelée de trois pièces ouverte d'argent et ajourée et maçonnée de sable",
	"./armorial_files/100px-Blason_de_la_famille_de_Toulbodou.svg.png": "D'or semé de feuilles de houx de sinople.",
	"./armorial_files/100px-Armoiries_La_Tour_(Auvergne).svg.png": "D'azur semé de fleurs de lys d'or et à la tour d'argent maçonnée et ouverte de sable",
	"./armorial_files/Blason_Famille_fr_de-Tournemire.svg.png": "D'or à trois bandes de sable ; à la bordure de gueules, chargée de onze besants d'or ; au franc-quartier d'hermine[211].",
	"./armorial_files/Blason_fr_famille_delatousche.svg.png": "D'or au lion de sable armé, lampassé et couronné de gueules.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "D'azur au chevron d'or, accompagné de trois croissants d'or placés en deux et un.",
	"./armorial_files/100px-Blason_duTranchant-deLaVerne.svg.png": "D'azur au dauphin d'argent couronné d'or, au chef d'argent chargé de trois mouchetures d'hermine.",
	"./armorial_files/Blason_fam_fr_Prévost_de_Sansac.svg.png": "D'argent à deux fasces de sable, et six merlettes du même, ordonnée trois, deux, et un",
	"./armorial_files/100px-Blason_Famille_fr_de-La-Trémolières.svg.png": "Parti d'Or et de gueules, à trois meules de moulin l'un en l'autre.",
	"./armorial_files/100px-Blason_Famille_fr_de-Trémouilles.svg.png": "D'or, à la crémaillère de sable.",
	"./armorial_files/100px-Blason_Matthieu_de_Trie.svg.png": "D'or à la bande d'azur.",
	"./armorial_files/100px-Blason_famille_fr_de_Tyange.svg.png": "D'argent à trois trèfles de gueule.",
	"./armorial_files/100px-Blason_fam_fr_Valbelle_(de).svg.png": "D'azur, à un lévrier rampant d'argent, colleté de gueules.",
	"./armorial_files/100px-Blason_de_la_famille_Valentin_de_Pardieu_Seigneur_d'Esquelbecq.svg.png": "D'or au chevron d'azur accompagné de trois étoiles de gueules.",
	"./armorial_files/100px-Blason_Famille_fr_Valette_(de-La).svg.png": "Ecartelé; au 1 Echiqueté d'or, qui est de POITIERS-ANCIEN; au 2 de gueules, à la croix vidée, cléchée et pommetée d'or, qui est de TOULOUSE; au 3 de gueules, au léopard lionné d'or, qui est de RODEZ; au 4 de gueules, à la croix ancrée d'or, qui est de SAINT-ANTONIN; sur le tout parti, aux 1 de gueules, au gerfaut d'argent, ayant la patte dextre levée, qui est de VALETTE; au 2 de gueules au lion d'or, lampassé et armé d'argent, qui est de MORLHON; l'écu posé sur la grande croix de l'ordre de Saint-Jean-de-Jérusalem, environné d'un manteau de gueules, fourré d'hermine et sommé d'une couronne de marquis. Supports : deux griffons au naturel, couronnés d'or, ayant chacun un collier de perles au cou, suspendant une croisette d'or et soutenant deux bannières; celle de dextre sur le tout de l'écu, celle de senestre de gueules à une croix de Malte d'argent. Cimier : un dextrochère tenant un poignard et portant un bouclier écartelé aux 1 et 4 de gueules, au château d'or sommé de trois tours de même qui est de CASTILLE; aux 2 et 3 d'argent au lion de gueules, qui est de LEON.",
	"./armorial_files/100px-Blason_Famille_fr_Valette_Morlhon_(de-La).svg.png": "Parti au 1 de gueules, au gerfaut d'argent ayant la patte dextre levée (de La Valette), au 2 de gueules au lion d'or, lampassé et armé d'argent (de Morlhon).",
	"./armorial_files/100px-Blason_Famille_fr_de-Valette-Parisot_(La).svg.png": "De gueules, au gerfaut d'argent ayant la patte dextre levée",
	"./armorial_files/100px-Blason_famille_de_Valous.svg.png": "De gueules à l'hermine d'argent colleté d'un mantelet de Bretagne au chef cousu d'azur chargé de trois étoiles d'or.",
	"./armorial_files/100px-Blason_famille_fr_de_Vanel.svg.png": "D'argent à un chêne de sinople, mouvant d'une terrasse du même.",
	"./armorial_files/100px-Vargas.svg.png": "D'argent aux trois fasces ondées d'azur.",
	"./armorial_files/100px-Blason_famille_fr_de_Vassail_de_Rignac_de_la_Barde.svg.png": "D'azur à la bande d'argent remplie de gueules chargée de trois besants d'or et accompagnée de deux étoiles du même.",
	"./armorial_files/100px-Blason_famille_fr_de_Vassinhac_d'Imecourt.svg.png": "D'azur à la bande cousue de sable remplie d'argent.",
	"aucune image": "De gueules emmanché d'argent de deux pièces.",
	"aucune image": "D'azur au chevron d'or accompagné de trois étoiles de même",
	"./armorial_files/100px-Blason_famille_de_Vaux.svg.png": "d'argent à trois têtes d'ours, arrachées de sable, muselées d'or",
	"./armorial_files/100px-Blason-Famille-de-Védelly1.svg.png": "D'azur au sautoir d'or accompagné en chef d'un œil d'argent",
	"./armorial_files/Blason_de_la_famille_Veillet_de_La_Vallée_et_Veillet_du_Frêche_-_XVIe_siècle.svg.png": "De sable à trois oies d'argent et une veilleuse allumée de gueules en son centre.",
	"./armorial_files/100px-Blason_Famille_La_Rochejaquelein.svg.png": "De sinople à la croix d'argent cantonnée de quatre coquilles du même et chargée d'une coquille de gueules en abîme.",
	"./armorial_files/100px-Blason_Vergy.svg.png": "de gueules à trois quintefeuilles d'or",
	"./armorial_files/100px-Blason_famille_fr_Verthamon.png": "Écartelé au 1 de gueules au lion léopardé d'or, aux 2 et 3 à cinq points d'or équipolés de quatre d'azur, au 4 de gueules plein.",
	"./armorial_files/100px-Blason_famille_fr_de-Veze.svg.png": "de gueules au chevron d'argent ; au chef d'or, chargé de trois étoiles de gueules",
	"aucune image": "De gueules à l'aigle d'or",
	"./armorial_files/100px-Blason_Famille_Vaublanc_2.svg.png": "de gueules au lion passant d'or, au chef d'argent chargé d'un soleil de gueules, accosté de deux grappes de raisins de sable (alias de pourpre)",
	"./armorial_files/100px-Blason_de_la_famille_de_vial.svg.png": "de sable à l'écusson d'argent au lyon de gueules armé et lampassé de même, soutenu par quatre lionceaux léopardés d'or, à la bordure d'argent chargée de huit globes cintés et croisés d'or",
	"./armorial_files/Blason_famille_fr_de_Vielchastel_(Vielcastel,_Vielzchastel),_seigneurs_de_Vertilly.svg.png": "De gueules, à la tour d'or.",
	"./armorial_files/100px-Vierzon.svg.png": "écartelé de sinople et de gueules.",
	"./armorial_files/100px-Blason_famille_fr_de_Villaines.svg.png": "écartelé au premier et quatrième : d'azur au lion d'or (rampant ou passant) ; au deuxième et troisième : de gueules à neuf losanges d'or, 3,3 et 3",
	"./armorial_files/100px-Blason_de_villeneuve.svg.png": "De gueules fascé d'argent.",
	"./armorial_files/100px-Blason_Barreme.svg.png": "De gueules, fretté de six lances d'or, les claires-voies semées d'écussons du mesme, à un écusson d'azur, brochant en cœur et chargé d'une fleur-de-lis d'or.",
	"./armorial_files/100px-Blason_ville_&_fam_fr_de_Villequier_(Seine-Maritime).svg.png": "De gueules, à la croix fleurdelisée d'or, cantonnée de douze billettes du même[213].",
	"./armorial_files/100px-Blason_famille_fr_de_Virieu.svg.png": "D'azur à trois vires d'or",
	"./armorial_files/100px-Vissac.svg.png": "D'or, à trois merlettes de sable.",
	"./armorial_files/Blason_Famille_fr_de-Vissec.png": "Écartelé, d'argent et de sable",
	"./armorial_files/100px-Blason_Famille_fr_de-Vissec_de_Latude.png": "Écartelé; aux 1 et 4 échiqueté de seize pièces d'or et de gueules; aux 2 et 3 contre-écartelé d'or et de gueules; sur le tout écartelé d'argent et de sable.",
	"./armorial_files/100px-Blason_Vogüé.svg.png": "D'azur, au coq d'or barbé et crêté de gueules.",
	"./armorial_files/114px-Blason_de_la_famille_de_Vuillefroy_de_Silly_avec_levrettes_dessinées_par_Orror.svg.png": "D'azur à deux levrettes rampantes affrontées et accolées d'argent.",
	"./armorial_files/Blason_à_dessiner.svg(6).png": "Écartelé aux 1 et 4 de gueules au lion d'argent couronné d'or, celui du 1 contourné, aux 2 et 3 d'argent semé de billettes d'azur, au lion de gueules couronné d'or brochant sur le tout, celui du 3 contourné.",
	"./armorial_files/100px-Blason_Famille_de_Wendel.png": "de gueules, à trois marteaux d'or, emmanchés du même, liés d'azur, dont deux passés en sautoir et le troisième brochant en pal et renversé, au tube de canon d'or posé en fasce, rangé en pointe, à une bordure d'argent",
	"./armorial_files/100px-Blason_deWidranges.svg.png": "D'azur à trois cygnes d'argent becqués et membrés d'or.",
	"./armorial_files/Blason_Maison_de_Wissocq.svg.png": "De gueules à la fasce d'argent, accompagnée de trois losanges d'or.",
	"./armorial_files/Blason_de_wolbock.png": "De gueules à face d'or.",
	"./armorial_files/100px-Blason_Famille_fr_d'Yzarn.svg.png": "De sable, au pairle d'or.",
	"./armorial_files/100px-Blason_Famille_fr_d'Ysarn_de_Freyssinet_de_Valady.svg.png": "De gueules, à la levrette courant d'argent colletée d'or, au chef cousu d'azur chargé de trois étoiles d'or.",
	"./armorial_files/100px-Blason_Famille_fr_d'Yzarn_de_Villefort.svg.png": "D'azur, à la fasce d'argent, accompagnée en chef de deux besants du même, et en pointe d'un croissant d'or.",
	"./armorial_files/100px-Blason_Famille_fr_d'Yzarn_de_Villefort-Cornus.svg.png": "D'azur, à la fasce d'or, accompagnée en chef de trois besants, et en pointe d'un croissant du même.",
	"./armorial_files/100px-Blasonzeller.svg.png": "De sable à deux chevrons de gueules dont l'un renversé mouvant du chef, accompagnés de trois pommes mal-ordonnées du même.",
	"./armorial_files/100px-Blason_famille_fr_van_Zeller_d'Oosthove.svg.png": "D'argent, à l'étoile de gueules accompagnée de trois merlettes de sable.",
}